Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
	volatile	uint32_t	LUT816L;
	volatile	uint32_t	LUT816H;
	volatile	uint32_t	LUT817L;
	volatile	uint32_t	LUT817H;
	volatile	uint32_t	LUT818L;
	volatile	uint32_t	LUT818H;
	volatile	uint32_t	LUT819L;
	volatile	uint32_t	LUT819H;
	volatile	uint32_t	LUT820L;
	volatile	uint32_t	LUT820H;
	volatile	uint32_t	LUT821L;
	volatile	uint32_t	LUT821H;
	volatile	uint32_t	LUT822L;
	volatile	uint32_t	LUT822H;
	volatile	uint32_t	LUT823L;
	volatile	uint32_t	LUT823H;
	volatile	uint32_t	LUT824L;
	volatile	uint32_t	LUT824H;
	volatile	uint32_t	LUT825L;
	volatile	uint32_t	LUT825H;
	volatile	uint32_t	LUT826L;
	volatile	uint32_t	LUT826H;
	volatile	uint32_t	LUT827L;
	volatile	uint32_t	LUT827H;
	volatile	uint32_t	LUT828L;
	volatile	uint32_t	LUT828H;
	volatile	uint32_t	LUT829L;
	volatile	uint32_t	LUT829H;
	volatile	uint32_t	LUT830L;
	volatile	uint32_t	LUT830H;
	volatile	uint32_t	LUT831L;
	volatile	uint32_t	LUT831H;
	volatile	uint32_t	LUT832L;
	volatile	uint32_t	LUT832H;
	volatile	uint32_t	LUT833L;
	volatile	uint32_t	LUT833H;
	volatile	uint32_t	LUT834L;
	volatile	uint32_t	LUT834H;
	volatile	uint32_t	LUT835L;
	volatile	uint32_t	LUT835H;
	volatile	uint32_t	LUT836L;
	volatile	uint32_t	LUT836H;
	volatile	uint32_t	LUT837L;
	volatile	uint32_t	LUT837H;
	volatile	uint32_t	LUT838L;
	volatile	uint32_t	LUT838H;
	volatile	uint32_t	LUT839L;
	volatile	uint32_t	LUT839H;
	volatile	uint32_t	LUT840L;
	volatile	uint32_t	LUT840H;
	volatile	uint32_t	LUT841L;
	volatile	uint32_t	LUT841H;
	volatile	uint32_t	LUT842L;
	volatile	uint32_t	LUT842H;
	volatile	uint32_t	LUT843L;
	volatile	uint32_t	LUT843H;
	volatile	uint32_t	LUT844L;
	volatile	uint32_t	LUT844H;
	volatile	uint32_t	LUT845L;
	volatile	uint32_t	LUT845H;
	volatile	uint32_t	LUT846L;
	volatile	uint32_t	LUT846H;
	volatile	uint32_t	LUT847L;
	volatile	uint32_t	LUT847H;
	volatile	uint32_t	LUT848L;
	volatile	uint32_t	LUT848H;
	volatile	uint32_t	LUT849L;
	volatile	uint32_t	LUT849H;
	volatile	uint32_t	LUT850L;
	volatile	uint32_t	LUT850H;
	volatile	uint32_t	LUT851L;
	volatile	uint32_t	LUT851H;
	volatile	uint32_t	LUT852L;
	volatile	uint32_t	LUT852H;
	volatile	uint32_t	LUT853L;
	volatile	uint32_t	LUT853H;
	volatile	uint32_t	LUT854L;
	volatile	uint32_t	LUT854H;
	volatile	uint32_t	LUT855L;
	volatile	uint32_t	LUT855H;
	volatile	uint32_t	LUT856L;
	volatile	uint32_t	LUT856H;
	volatile	uint32_t	LUT857L;
	volatile	uint32_t	LUT857H;
	volatile	uint32_t	LUT858L;
	volatile	uint32_t	LUT858H;
	volatile	uint32_t	LUT859L;
	volatile	uint32_t	LUT859H;
	volatile	uint32_t	LUT860L;
	volatile	uint32_t	LUT860H;
	volatile	uint32_t	LUT861L;
	volatile	uint32_t	LUT861H;
	volatile	uint32_t	LUT862L;
	volatile	uint32_t	LUT862H;
	volatile	uint32_t	LUT863L;
	volatile	uint32_t	LUT863H;
	volatile	uint32_t	LUT864L;
	volatile	uint32_t	LUT864H;
	volatile	uint32_t	LUT865L;
	volatile	uint32_t	LUT865H;
	volatile	uint32_t	LUT866L;
	volatile	uint32_t	LUT866H;
	volatile	uint32_t	LUT867L;
	volatile	uint32_t	LUT867H;
	volatile	uint32_t	LUT868L;
	volatile	uint32_t	LUT868H;
	volatile	uint32_t	LUT869L;
	volatile	uint32_t	LUT869H;
	volatile	uint32_t	LUT870L;
	volatile	uint32_t	LUT870H;
	volatile	uint32_t	LUT871L;
	volatile	uint32_t	LUT871H;
	volatile	uint32_t	LUT872L;
	volatile	uint32_t	LUT872H;
	volatile	uint32_t	LUT873L;
	volatile	uint32_t	LUT873H;
	volatile	uint32_t	LUT874L;
	volatile	uint32_t	LUT874H;
	volatile	uint32_t	LUT875L;
	volatile	uint32_t	LUT875H;
	volatile	uint32_t	LUT876L;
	volatile	uint32_t	LUT876H;
	volatile	uint32_t	LUT877L;
	volatile	uint32_t	LUT877H;
	volatile	uint32_t	LUT878L;
	volatile	uint32_t	LUT878H;
	volatile	uint32_t	LUT879L;
	volatile	uint32_t	LUT879H;
	volatile	uint32_t	LUT880L;
	volatile	uint32_t	LUT880H;
	volatile	uint32_t	LUT881L;
	volatile	uint32_t	LUT881H;
	volatile	uint32_t	LUT882L;
	volatile	uint32_t	LUT882H;
	volatile	uint32_t	LUT883L;
	volatile	uint32_t	LUT883H;
	volatile	uint32_t	LUT884L;
	volatile	uint32_t	LUT884H;
	volatile	uint32_t	LUT885L;
	volatile	uint32_t	LUT885H;
	volatile	uint32_t	LUT886L;
	volatile	uint32_t	LUT886H;
	volatile	uint32_t	LUT887L;
	volatile	uint32_t	LUT887H;
	volatile	uint32_t	LUT888L;
	volatile	uint32_t	LUT888H;
	volatile	uint32_t	LUT889L;
	volatile	uint32_t	LUT889H;
	volatile	uint32_t	LUT890L;
	volatile	uint32_t	LUT890H;
	volatile	uint32_t	LUT891L;
	volatile	uint32_t	LUT891H;
	volatile	uint32_t	LUT892L;
	volatile	uint32_t	LUT892H;
	volatile	uint32_t	LUT893L;
	volatile	uint32_t	LUT893H;
	volatile	uint32_t	LUT894L;
	volatile	uint32_t	LUT894H;
	volatile	uint32_t	LUT895L;
	volatile	uint32_t	LUT895H;
	volatile	uint32_t	LUT896L;
	volatile	uint32_t	LUT896H;
	volatile	uint32_t	LUT897L;
	volatile	uint32_t	LUT897H;
	volatile	uint32_t	LUT898L;
	volatile	uint32_t	LUT898H;
	volatile	uint32_t	LUT899L;
	volatile	uint32_t	LUT899H;
	volatile	uint32_t	LUT900L;
	volatile	uint32_t	LUT900H;
	volatile	uint32_t	LUT901L;
	volatile	uint32_t	LUT901H;
	volatile	uint32_t	LUT902L;
	volatile	uint32_t	LUT902H;
	volatile	uint32_t	LUT903L;
	volatile	uint32_t	LUT903H;
	volatile	uint32_t	LUT904L;
	volatile	uint32_t	LUT904H;
	volatile	uint32_t	LUT905L;
	volatile	uint32_t	LUT905H;
	volatile	uint32_t	LUT906L;
	volatile	uint32_t	LUT906H;
	volatile	uint32_t	LUT907L;
	volatile	uint32_t	LUT907H;
	volatile	uint32_t	LUT908L;
	volatile	uint32_t	LUT908H;
	volatile	uint32_t	LUT909L;
	volatile	uint32_t	LUT909H;
	volatile	uint32_t	LUT910L;
	volatile	uint32_t	LUT910H;
	volatile	uint32_t	LUT911L;
	volatile	uint32_t	LUT911H;
	volatile	uint32_t	LUT912L;
	volatile	uint32_t	LUT912H;
	volatile	uint32_t	LUT913L;
	volatile	uint32_t	LUT913H;
	volatile	uint32_t	LUT914L;
	volatile	uint32_t	LUT914H;
	volatile	uint32_t	LUT915L;
	volatile	uint32_t	LUT915H;
	volatile	uint32_t	LUT916L;
	volatile	uint32_t	LUT916H;
	volatile	uint32_t	LUT917L;
	volatile	uint32_t	LUT917H;
	volatile	uint32_t	LUT918L;
	volatile	uint32_t	LUT918H;
	volatile	uint32_t	LUT919L;
	volatile	uint32_t	LUT919H;
	volatile	uint32_t	LUT920L;
	volatile	uint32_t	LUT920H;
	volatile	uint32_t	LUT921L;
	volatile	uint32_t	LUT921H;
	volatile	uint32_t	LUT922L;
	volatile	uint32_t	LUT922H;
	volatile	uint32_t	LUT923L;
	volatile	uint32_t	LUT923H;
	volatile	uint32_t	LUT924L;
	volatile	uint32_t	LUT924H;
	volatile	uint32_t	LUT925L;
	volatile	uint32_t	LUT925H;
	volatile	uint32_t	LUT926L;
	volatile	uint32_t	LUT926H;
	volatile	uint32_t	LUT927L;
	volatile	uint32_t	LUT927H;
	volatile	uint32_t	LUT928L;
	volatile	uint32_t	LUT928H;
	volatile	uint32_t	LUT929L;
	volatile	uint32_t	LUT929H;
	volatile	uint32_t	LUT930L;
	volatile	uint32_t	LUT930H;
	volatile	uint32_t	LUT931L;
	volatile	uint32_t	LUT931H;
	volatile	uint32_t	LUT932L;
	volatile	uint32_t	LUT932H;
	volatile	uint32_t	LUT933L;
	volatile	uint32_t	LUT933H;
	volatile	uint32_t	LUT934L;
	volatile	uint32_t	LUT934H;
	volatile	uint32_t	LUT935L;
	volatile	uint32_t	LUT935H;
	volatile	uint32_t	LUT936L;
	volatile	uint32_t	LUT936H;
	volatile	uint32_t	LUT937L;
	volatile	uint32_t	LUT937H;
	volatile	uint32_t	LUT938L;
	volatile	uint32_t	LUT938H;
	volatile	uint32_t	LUT939L;
	volatile	uint32_t	LUT939H;
	volatile	uint32_t	LUT940L;
	volatile	uint32_t	LUT940H;
	volatile	uint32_t	LUT941L;
	volatile	uint32_t	LUT941H;
	volatile	uint32_t	LUT942L;
	volatile	uint32_t	LUT942H;
	volatile	uint32_t	LUT943L;
	volatile	uint32_t	LUT943H;
	volatile	uint32_t	LUT944L;
	volatile	uint32_t	LUT944H;
	volatile	uint32_t	LUT945L;
	volatile	uint32_t	LUT945H;
	volatile	uint32_t	LUT946L;
	volatile	uint32_t	LUT946H;
	volatile	uint32_t	LUT947L;
	volatile	uint32_t	LUT947H;
	volatile	uint32_t	LUT948L;
	volatile	uint32_t	LUT948H;
	volatile	uint32_t	LUT949L;
	volatile	uint32_t	LUT949H;
	volatile	uint32_t	LUT950L;
	volatile	uint32_t	LUT950H;
	volatile	uint32_t	LUT951L;
	volatile	uint32_t	LUT951H;
	volatile	uint32_t	LUT952L;
	volatile	uint32_t	LUT952H;
	volatile	uint32_t	LUT953L;
	volatile	uint32_t	LUT953H;
	volatile	uint32_t	LUT954L;
	volatile	uint32_t	LUT954H;
	volatile	uint32_t	LUT955L;
	volatile	uint32_t	LUT955H;
	volatile	uint32_t	LUT956L;
	volatile	uint32_t	LUT956H;
	volatile	uint32_t	LUT957L;
	volatile	uint32_t	LUT957H;
	volatile	uint32_t	LUT958L;
	volatile	uint32_t	LUT958H;
	volatile	uint32_t	LUT959L;
	volatile	uint32_t	LUT959H;
	volatile	uint32_t	LUT960L;
	volatile	uint32_t	LUT960H;
	volatile	uint32_t	LUT961L;
	volatile	uint32_t	LUT961H;
	volatile	uint32_t	LUT962L;
	volatile	uint32_t	LUT962H;
	volatile	uint32_t	LUT963L;
	volatile	uint32_t	LUT963H;
	volatile	uint32_t	LUT964L;
	volatile	uint32_t	LUT964H;
	volatile	uint32_t	LUT965L;
	volatile	uint32_t	LUT965H;
	volatile	uint32_t	LUT966L;
	volatile	uint32_t	LUT966H;
	volatile	uint32_t	LUT967L;
	volatile	uint32_t	LUT967H;
	volatile	uint32_t	LUT968L;
	volatile	uint32_t	LUT968H;
	volatile	uint32_t	LUT969L;
	volatile	uint32_t	LUT969H;
	volatile	uint32_t	LUT970L;
	volatile	uint32_t	LUT970H;
	volatile	uint32_t	LUT971L;
	volatile	uint32_t	LUT971H;
	volatile	uint32_t	LUT972L;
	volatile	uint32_t	LUT972H;
	volatile	uint32_t	LUT973L;
	volatile	uint32_t	LUT973H;
	volatile	uint32_t	LUT974L;
	volatile	uint32_t	LUT974H;
	volatile	uint32_t	LUT975L;
	volatile	uint32_t	LUT975H;
	volatile	uint32_t	LUT976L;
	volatile	uint32_t	LUT976H;
	volatile	uint32_t	LUT977L;
	volatile	uint32_t	LUT977H;
	volatile	uint32_t	LUT978L;
	volatile	uint32_t	LUT978H;
	volatile	uint32_t	LUT979L;
	volatile	uint32_t	LUT979H;
	volatile	uint32_t	LUT980L;
	volatile	uint32_t	LUT980H;
	volatile	uint32_t	LUT981L;
	volatile	uint32_t	LUT981H;
	volatile	uint32_t	LUT982L;
	volatile	uint32_t	LUT982H;
	volatile	uint32_t	LUT983L;
	volatile	uint32_t	LUT983H;
	volatile	uint32_t	LUT984L;
	volatile	uint32_t	LUT984H;
	volatile	uint32_t	LUT985L;
	volatile	uint32_t	LUT985H;
	volatile	uint32_t	LUT986L;
	volatile	uint32_t	LUT986H;
	volatile	uint32_t	LUT987L;
	volatile	uint32_t	LUT987H;
	volatile	uint32_t	LUT988L;
	volatile	uint32_t	LUT988H;
	volatile	uint32_t	LUT989L;
	volatile	uint32_t	LUT989H;
	volatile	uint32_t	LUT990L;
	volatile	uint32_t	LUT990H;
	volatile	uint32_t	LUT991L;
	volatile	uint32_t	LUT991H;
	volatile	uint32_t	LUT992L;
	volatile	uint32_t	LUT992H;
	volatile	uint32_t	LUT993L;
	volatile	uint32_t	LUT993H;
	volatile	uint32_t	LUT994L;
	volatile	uint32_t	LUT994H;
	volatile	uint32_t	LUT995L;
	volatile	uint32_t	LUT995H;
	volatile	uint32_t	LUT996L;
	volatile	uint32_t	LUT996H;
	volatile	uint32_t	LUT997L;
	volatile	uint32_t	LUT997H;
	volatile	uint32_t	LUT998L;
	volatile	uint32_t	LUT998H;
	volatile	uint32_t	LUT999L;
	volatile	uint32_t	LUT999H;
	volatile	uint32_t	LUT1000L;
	volatile	uint32_t	LUT1000H;
	volatile	uint32_t	LUT1001L;
	volatile	uint32_t	LUT1001H;
	volatile	uint32_t	LUT1002L;
	volatile	uint32_t	LUT1002H;
	volatile	uint32_t	LUT1003L;
	volatile	uint32_t	LUT1003H;
	volatile	uint32_t	LUT1004L;
	volatile	uint32_t	LUT1004H;
	volatile	uint32_t	LUT1005L;
	volatile	uint32_t	LUT1005H;
	volatile	uint32_t	LUT1006L;
	volatile	uint32_t	LUT1006H;
	volatile	uint32_t	LUT1007L;
	volatile	uint32_t	LUT1007H;
	volatile	uint32_t	LUT1008L;
	volatile	uint32_t	LUT1008H;
	volatile	uint32_t	LUT1009L;
	volatile	uint32_t	LUT1009H;
	volatile	uint32_t	LUT1010L;
	volatile	uint32_t	LUT1010H;
	volatile	uint32_t	LUT1011L;
	volatile	uint32_t	LUT1011H;
	volatile	uint32_t	LUT1012L;
	volatile	uint32_t	LUT1012H;
	volatile	uint32_t	LUT1013L;
	volatile	uint32_t	LUT1013H;
	volatile	uint32_t	LUT1014L;
	volatile	uint32_t	LUT1014H;
	volatile	uint32_t	LUT1015L;
	volatile	uint32_t	LUT1015H;
	volatile	uint32_t	LUT1016L;
	volatile	uint32_t	LUT1016H;
	volatile	uint32_t	LUT1017L;
	volatile	uint32_t	LUT1017H;
	volatile	uint32_t	LUT1018L;
	volatile	uint32_t	LUT1018H;
	volatile	uint32_t	LUT1019L;
	volatile	uint32_t	LUT1019H;
	volatile	uint32_t	LUT1020L;
	volatile	uint32_t	LUT1020H;
	volatile	uint32_t	LUT1021L;
	volatile	uint32_t	LUT1021H;
	volatile	uint32_t	LUT1022L;
	volatile	uint32_t	LUT1022H;
	volatile	uint32_t	LUT1023L;
	volatile	uint32_t	LUT1023H;
} GFXMMU_TypeDef;

#ifdef __cplusplus
#define	GFXMMU	reinterpret_cast<GFXMMU_TypeDef *>(0x4002C000u)

#else
#define	GFXMMU	((GFXMMU_TypeDef *)0x4002C000u)
#endif

