Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
// CR Configuration

#define	GFXMMU_CR_BM192			(0x1u<<6)
#define	GFXMMU_CR_AMEIE			(0x1u<<4)
#define	GFXMMU_CR_B3OIE			(0x1u<<3)
#define	GFXMMU_CR_B2OIE			(0x1u<<2)
#define	GFXMMU_CR_B1OIE			(0x1u<<1)
#define	GFXMMU_CR_B0OIE			(0x1u<<0)

// SR Configuration

#define	GFXMMU_SR_AMEF			(0x1u<<4)
#define	GFXMMU_SR_B3OF			(0x1u<<3)
#define	GFXMMU_SR_B2OF			(0x1u<<2)
#define	GFXMMU_SR_B1OF			(0x1u<<1)
#define	GFXMMU_SR_B0OF			(0x1u<<0)

// FCR Configuration

#define	GFXMMU_FCR_CAMEF		(0x1u<<4)
#define	GFXMMU_FCR_CB3OF		(0x1u<<3)
#define	GFXMMU_FCR_CB2OF		(0x1u<<2)
#define	GFXMMU_FCR_CB1OF		(0x1u<<1)
#define	GFXMMU_FCR_CB0OF		(0x1u<<0)

// DVR Configuration

#define	GFXMMU_DVR_DV			(0xFFFFFFFFu<<0)
#define	GFXMMU_DVR_DV_0			(0x1u<<0)

// B0CR Configuration

#define	GFXMMU_B0CR_PBBA		(0x1FFu<<23)
#define	GFXMMU_B0CR_PBBA_0		(0x1u<<23)
#define	GFXMMU_B0CR_PBO			(0x7FFFFu<<4)
#define	GFXMMU_B0CR_PBO_0		(0x1u<<4)

// B1CR Configuration

#define	GFXMMU_B1CR_PBBA		(0x1FFu<<23)
#define	GFXMMU_B1CR_PBBA_0		(0x1u<<23)
#define	GFXMMU_B1CR_PBO			(0x7FFFFu<<4)
#define	GFXMMU_B1CR_PBO_0		(0x1u<<4)

// B2CR Configuration

#define	GFXMMU_B2CR_PBBA		(0x1FFu<<23)
#define	GFXMMU_B2CR_PBBA_0		(0x1u<<23)
#define	GFXMMU_B2CR_PBO			(0x7FFFFu<<4)
#define	GFXMMU_B2CR_PBO_0		(0x1u<<4)

// B3CR Configuration

#define	GFXMMU_B3CR_PBBA		(0x1FFu<<23)
#define	GFXMMU_B3CR_PBBA_0		(0x1u<<23)
#define	GFXMMU_B3CR_PBO			(0x7FFFFu<<4)
#define	GFXMMU_B3CR_PBO_0		(0x1u<<4)

// VERR Configuration

#define	GFXMMU_VERR_MAJREV		(0xFu<<4)
#define	GFXMMU_VERR_MAJREV_0	(0x1u<<4)
#define	GFXMMU_VERR_MINREV		(0xFu<<0)
#define	GFXMMU_VERR_MINREV_0	(0x1u<<0)

// IPIDR Configuration

#define	GFXMMU_IPIDR_ID			(0xFFFFFFFFu<<0)
#define	GFXMMU_IPIDR_ID_0		(0x1u<<0)

// SIDR Configuration

#define	GFXMMU_SIDR_SID			(0xFFFFFFFFu<<0)
#define	GFXMMU_SIDR_SID_0		(0x1u<<0)

// LUT0L Configuration

#define	GFXMMU_LUT0L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT0L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT0L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT0L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT0L_EN			(0x1u<<0)

// LUT0H Configuration

#define	GFXMMU_LUT0H_LO			(0x3FFFFu<<4)
#define	GFXMMU_LUT0H_LO_0		(0x1u<<4)

// LUT1L Configuration

#define	GFXMMU_LUT1L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT1L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT1L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT1L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT1L_EN			(0x1u<<0)

// LUT1H Configuration

#define	GFXMMU_LUT1H_LO			(0x3FFFFu<<4)
#define	GFXMMU_LUT1H_LO_0		(0x1u<<4)

// LUT2L Configuration

#define	GFXMMU_LUT2L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT2L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT2L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT2L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT2L_EN			(0x1u<<0)

// LUT2H Configuration

#define	GFXMMU_LUT2H_LO			(0x3FFFFu<<4)
#define	GFXMMU_LUT2H_LO_0		(0x1u<<4)

// LUT3L Configuration

#define	GFXMMU_LUT3L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT3L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT3L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT3L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT3L_EN			(0x1u<<0)

// LUT3H Configuration

#define	GFXMMU_LUT3H_LO			(0x3FFFFu<<4)
#define	GFXMMU_LUT3H_LO_0		(0x1u<<4)

// LUT4L Configuration

#define	GFXMMU_LUT4L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT4L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT4L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT4L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT4L_EN			(0x1u<<0)

// LUT4H Configuration

#define	GFXMMU_LUT4H_LO			(0x3FFFFu<<4)
#define	GFXMMU_LUT4H_LO_0		(0x1u<<4)

// LUT5L Configuration

#define	GFXMMU_LUT5L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT5L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT5L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT5L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT5L_EN			(0x1u<<0)

// LUT5H Configuration

#define	GFXMMU_LUT5H_LO			(0x3FFFFu<<4)
#define	GFXMMU_LUT5H_LO_0		(0x1u<<4)

// LUT6L Configuration

#define	GFXMMU_LUT6L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT6L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT6L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT6L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT6L_EN			(0x1u<<0)

// LUT6H Configuration

#define	GFXMMU_LUT6H_LO			(0x3FFFFu<<4)
#define	GFXMMU_LUT6H_LO_0		(0x1u<<4)

// LUT7L Configuration

#define	GFXMMU_LUT7L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT7L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT7L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT7L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT7L_EN			(0x1u<<0)

// LUT7H Configuration

#define	GFXMMU_LUT7H_LO			(0x3FFFFu<<4)
#define	GFXMMU_LUT7H_LO_0		(0x1u<<4)

// LUT8L Configuration

#define	GFXMMU_LUT8L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT8L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT8L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT8L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT8L_EN			(0x1u<<0)

// LUT8H Configuration

#define	GFXMMU_LUT8H_LO			(0x3FFFFu<<4)
#define	GFXMMU_LUT8H_LO_0		(0x1u<<4)

// LUT9L Configuration

#define	GFXMMU_LUT9L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT9L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT9L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT9L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT9L_EN			(0x1u<<0)

// LUT9H Configuration

#define	GFXMMU_LUT9H_LO			(0x3FFFFu<<4)
#define	GFXMMU_LUT9H_LO_0		(0x1u<<4)

// LUT10L Configuration

#define	GFXMMU_LUT10L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT10L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT10L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT10L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT10L_EN		(0x1u<<0)

// LUT10H Configuration

#define	GFXMMU_LUT10H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT10H_LO_0		(0x1u<<4)

// LUT11L Configuration

#define	GFXMMU_LUT11L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT11L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT11L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT11L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT11L_EN		(0x1u<<0)

// LUT11H Configuration

#define	GFXMMU_LUT11H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT11H_LO_0		(0x1u<<4)

// LUT12L Configuration

#define	GFXMMU_LUT12L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT12L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT12L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT12L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT12L_EN		(0x1u<<0)

// LUT12H Configuration

#define	GFXMMU_LUT12H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT12H_LO_0		(0x1u<<4)

// LUT13L Configuration

#define	GFXMMU_LUT13L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT13L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT13L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT13L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT13L_EN		(0x1u<<0)

// LUT13H Configuration

#define	GFXMMU_LUT13H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT13H_LO_0		(0x1u<<4)

// LUT14L Configuration

#define	GFXMMU_LUT14L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT14L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT14L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT14L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT14L_EN		(0x1u<<0)

// LUT14H Configuration

#define	GFXMMU_LUT14H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT14H_LO_0		(0x1u<<4)

