Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
// LUT33H Configuration

#define	GFXMMU_LUT33H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT33H_LO_0		(0x1u<<4)

// LUT34L Configuration

#define	GFXMMU_LUT34L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT34L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT34L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT34L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT34L_EN		(0x1u<<0)

// LUT34H Configuration

#define	GFXMMU_LUT34H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT34H_LO_0		(0x1u<<4)

// LUT35L Configuration

#define	GFXMMU_LUT35L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT35L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT35L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT35L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT35L_EN		(0x1u<<0)

// LUT35H Configuration

#define	GFXMMU_LUT35H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT35H_LO_0		(0x1u<<4)

// LUT36L Configuration

#define	GFXMMU_LUT36L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT36L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT36L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT36L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT36L_EN		(0x1u<<0)

// LUT36H Configuration

#define	GFXMMU_LUT36H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT36H_LO_0		(0x1u<<4)

// LUT37L Configuration

#define	GFXMMU_LUT37L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT37L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT37L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT37L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT37L_EN		(0x1u<<0)

// LUT37H Configuration

#define	GFXMMU_LUT37H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT37H_LO_0		(0x1u<<4)

// LUT38L Configuration

#define	GFXMMU_LUT38L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT38L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT38L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT38L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT38L_EN		(0x1u<<0)

// LUT38H Configuration

#define	GFXMMU_LUT38H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT38H_LO_0		(0x1u<<4)

// LUT39L Configuration

#define	GFXMMU_LUT39L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT39L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT39L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT39L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT39L_EN		(0x1u<<0)

// LUT39H Configuration

#define	GFXMMU_LUT39H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT39H_LO_0		(0x1u<<4)

// LUT40L Configuration

#define	GFXMMU_LUT40L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT40L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT40L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT40L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT40L_EN		(0x1u<<0)

// LUT40H Configuration

#define	GFXMMU_LUT40H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT40H_LO_0		(0x1u<<4)

// LUT41L Configuration

#define	GFXMMU_LUT41L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT41L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT41L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT41L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT41L_EN		(0x1u<<0)

// LUT41H Configuration

#define	GFXMMU_LUT41H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT41H_LO_0		(0x1u<<4)

// LUT42L Configuration

#define	GFXMMU_LUT42L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT42L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT42L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT42L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT42L_EN		(0x1u<<0)

// LUT42H Configuration

#define	GFXMMU_LUT42H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT42H_LO_0		(0x1u<<4)

// LUT43L Configuration

#define	GFXMMU_LUT43L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT43L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT43L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT43L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT43L_EN		(0x1u<<0)

// LUT43H Configuration

#define	GFXMMU_LUT43H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT43H_LO_0		(0x1u<<4)

// LUT44L Configuration

#define	GFXMMU_LUT44L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT44L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT44L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT44L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT44L_EN		(0x1u<<0)

// LUT44H Configuration

#define	GFXMMU_LUT44H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT44H_LO_0		(0x1u<<4)

// LUT45L Configuration

#define	GFXMMU_LUT45L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT45L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT45L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT45L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT45L_EN		(0x1u<<0)

// LUT45H Configuration

#define	GFXMMU_LUT45H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT45H_LO_0		(0x1u<<4)

// LUT46L Configuration

#define	GFXMMU_LUT46L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT46L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT46L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT46L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT46L_EN		(0x1u<<0)

// LUT46H Configuration

#define	GFXMMU_LUT46H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT46H_LO_0		(0x1u<<4)

// LUT47L Configuration

#define	GFXMMU_LUT47L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT47L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT47L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT47L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT47L_EN		(0x1u<<0)

// LUT47H Configuration

#define	GFXMMU_LUT47H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT47H_LO_0		(0x1u<<4)

// LUT48L Configuration

#define	GFXMMU_LUT48L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT48L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT48L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT48L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT48L_EN		(0x1u<<0)

// LUT48H Configuration

#define	GFXMMU_LUT48H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT48H_LO_0		(0x1u<<4)

// LUT49L Configuration

#define	GFXMMU_LUT49L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT49L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT49L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT49L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT49L_EN		(0x1u<<0)

// LUT49H Configuration

#define	GFXMMU_LUT49H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT49H_LO_0		(0x1u<<4)

// LUT50L Configuration

#define	GFXMMU_LUT50L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT50L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT50L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT50L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT50L_EN		(0x1u<<0)

// LUT50H Configuration

#define	GFXMMU_LUT50H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT50H_LO_0		(0x1u<<4)

// LUT51L Configuration

#define	GFXMMU_LUT51L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT51L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT51L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT51L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT51L_EN		(0x1u<<0)

// LUT51H Configuration

#define	GFXMMU_LUT51H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT51H_LO_0		(0x1u<<4)

// LUT52L Configuration

#define	GFXMMU_LUT52L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT52L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT52L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT52L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT52L_EN		(0x1u<<0)

// LUT52H Configuration

#define	GFXMMU_LUT52H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT52H_LO_0		(0x1u<<4)

// LUT53L Configuration

#define	GFXMMU_LUT53L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT53L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT53L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT53L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT53L_EN		(0x1u<<0)

