Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
// LUT53H Configuration

#define	GFXMMU_LUT53H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT53H_LO_0		(0x1u<<4)

// LUT54L Configuration

#define	GFXMMU_LUT54L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT54L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT54L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT54L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT54L_EN		(0x1u<<0)

// LUT54H Configuration

#define	GFXMMU_LUT54H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT54H_LO_0		(0x1u<<4)

// LUT55L Configuration

#define	GFXMMU_LUT55L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT55L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT55L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT55L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT55L_EN		(0x1u<<0)

// LUT55H Configuration

#define	GFXMMU_LUT55H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT55H_LO_0		(0x1u<<4)

// LUT56L Configuration

#define	GFXMMU_LUT56L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT56L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT56L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT56L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT56L_EN		(0x1u<<0)

// LUT56H Configuration

#define	GFXMMU_LUT56H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT56H_LO_0		(0x1u<<4)

// LUT57L Configuration

#define	GFXMMU_LUT57L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT57L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT57L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT57L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT57L_EN		(0x1u<<0)

// LUT57H Configuration

#define	GFXMMU_LUT57H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT57H_LO_0		(0x1u<<4)

// LUT58L Configuration

#define	GFXMMU_LUT58L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT58L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT58L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT58L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT58L_EN		(0x1u<<0)

// LUT58H Configuration

#define	GFXMMU_LUT58H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT58H_LO_0		(0x1u<<4)

// LUT59L Configuration

#define	GFXMMU_LUT59L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT59L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT59L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT59L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT59L_EN		(0x1u<<0)

// LUT59H Configuration

#define	GFXMMU_LUT59H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT59H_LO_0		(0x1u<<4)

// LUT60L Configuration

#define	GFXMMU_LUT60L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT60L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT60L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT60L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT60L_EN		(0x1u<<0)

// LUT60H Configuration

#define	GFXMMU_LUT60H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT60H_LO_0		(0x1u<<4)

// LUT61L Configuration

#define	GFXMMU_LUT61L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT61L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT61L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT61L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT61L_EN		(0x1u<<0)

// LUT61H Configuration

#define	GFXMMU_LUT61H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT61H_LO_0		(0x1u<<4)

// LUT62L Configuration

#define	GFXMMU_LUT62L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT62L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT62L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT62L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT62L_EN		(0x1u<<0)

// LUT62H Configuration

#define	GFXMMU_LUT62H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT62H_LO_0		(0x1u<<4)

// LUT63L Configuration

#define	GFXMMU_LUT63L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT63L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT63L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT63L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT63L_EN		(0x1u<<0)

// LUT63H Configuration

#define	GFXMMU_LUT63H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT63H_LO_0		(0x1u<<4)

// LUT64L Configuration

#define	GFXMMU_LUT64L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT64L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT64L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT64L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT64L_EN		(0x1u<<0)

// LUT64H Configuration

#define	GFXMMU_LUT64H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT64H_LO_0		(0x1u<<4)

// LUT65L Configuration

#define	GFXMMU_LUT65L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT65L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT65L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT65L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT65L_EN		(0x1u<<0)

// LUT65H Configuration

#define	GFXMMU_LUT65H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT65H_LO_0		(0x1u<<4)

// LUT66L Configuration

#define	GFXMMU_LUT66L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT66L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT66L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT66L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT66L_EN		(0x1u<<0)

// LUT66H Configuration

#define	GFXMMU_LUT66H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT66H_LO_0		(0x1u<<4)

// LUT67L Configuration

#define	GFXMMU_LUT67L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT67L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT67L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT67L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT67L_EN		(0x1u<<0)

// LUT67H Configuration

#define	GFXMMU_LUT67H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT67H_LO_0		(0x1u<<4)

// LUT68L Configuration

#define	GFXMMU_LUT68L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT68L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT68L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT68L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT68L_EN		(0x1u<<0)

// LUT68H Configuration

#define	GFXMMU_LUT68H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT68H_LO_0		(0x1u<<4)

// LUT69L Configuration

#define	GFXMMU_LUT69L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT69L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT69L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT69L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT69L_EN		(0x1u<<0)

// LUT69H Configuration

#define	GFXMMU_LUT69H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT69H_LO_0		(0x1u<<4)

// LUT70L Configuration

#define	GFXMMU_LUT70L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT70L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT70L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT70L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT70L_EN		(0x1u<<0)

// LUT70H Configuration

#define	GFXMMU_LUT70H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT70H_LO_0		(0x1u<<4)

// LUT71L Configuration

#define	GFXMMU_LUT71L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT71L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT71L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT71L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT71L_EN		(0x1u<<0)

// LUT71H Configuration

#define	GFXMMU_LUT71H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT71H_LO_0		(0x1u<<4)

// LUT72L Configuration

#define	GFXMMU_LUT72L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT72L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT72L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT72L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT72L_EN		(0x1u<<0)

// LUT72H Configuration

#define	GFXMMU_LUT72H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT72H_LO_0		(0x1u<<4)

