Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
// LUT73L Configuration

#define	GFXMMU_LUT73L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT73L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT73L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT73L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT73L_EN		(0x1u<<0)

// LUT73H Configuration

#define	GFXMMU_LUT73H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT73H_LO_0		(0x1u<<4)

// LUT74L Configuration

#define	GFXMMU_LUT74L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT74L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT74L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT74L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT74L_EN		(0x1u<<0)

// LUT74H Configuration

#define	GFXMMU_LUT74H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT74H_LO_0		(0x1u<<4)

// LUT75L Configuration

#define	GFXMMU_LUT75L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT75L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT75L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT75L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT75L_EN		(0x1u<<0)

// LUT75H Configuration

#define	GFXMMU_LUT75H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT75H_LO_0		(0x1u<<4)

// LUT76L Configuration

#define	GFXMMU_LUT76L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT76L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT76L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT76L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT76L_EN		(0x1u<<0)

// LUT76H Configuration

#define	GFXMMU_LUT76H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT76H_LO_0		(0x1u<<4)

// LUT77L Configuration

#define	GFXMMU_LUT77L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT77L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT77L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT77L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT77L_EN		(0x1u<<0)

// LUT77H Configuration

#define	GFXMMU_LUT77H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT77H_LO_0		(0x1u<<4)

// LUT78L Configuration

#define	GFXMMU_LUT78L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT78L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT78L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT78L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT78L_EN		(0x1u<<0)

// LUT78H Configuration

#define	GFXMMU_LUT78H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT78H_LO_0		(0x1u<<4)

// LUT79L Configuration

#define	GFXMMU_LUT79L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT79L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT79L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT79L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT79L_EN		(0x1u<<0)

// LUT79H Configuration

#define	GFXMMU_LUT79H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT79H_LO_0		(0x1u<<4)

// LUT80L Configuration

#define	GFXMMU_LUT80L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT80L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT80L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT80L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT80L_EN		(0x1u<<0)

// LUT80H Configuration

#define	GFXMMU_LUT80H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT80H_LO_0		(0x1u<<4)

// LUT81L Configuration

#define	GFXMMU_LUT81L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT81L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT81L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT81L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT81L_EN		(0x1u<<0)

// LUT81H Configuration

#define	GFXMMU_LUT81H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT81H_LO_0		(0x1u<<4)

// LUT82L Configuration

#define	GFXMMU_LUT82L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT82L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT82L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT82L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT82L_EN		(0x1u<<0)

// LUT82H Configuration

#define	GFXMMU_LUT82H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT82H_LO_0		(0x1u<<4)

// LUT83L Configuration

#define	GFXMMU_LUT83L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT83L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT83L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT83L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT83L_EN		(0x1u<<0)

// LUT83H Configuration

#define	GFXMMU_LUT83H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT83H_LO_0		(0x1u<<4)

// LUT84L Configuration

#define	GFXMMU_LUT84L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT84L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT84L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT84L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT84L_EN		(0x1u<<0)

// LUT84H Configuration

#define	GFXMMU_LUT84H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT84H_LO_0		(0x1u<<4)

// LUT85L Configuration

#define	GFXMMU_LUT85L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT85L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT85L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT85L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT85L_EN		(0x1u<<0)

// LUT85H Configuration

#define	GFXMMU_LUT85H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT85H_LO_0		(0x1u<<4)

// LUT86L Configuration

#define	GFXMMU_LUT86L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT86L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT86L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT86L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT86L_EN		(0x1u<<0)

// LUT86H Configuration

#define	GFXMMU_LUT86H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT86H_LO_0		(0x1u<<4)

// LUT87L Configuration

#define	GFXMMU_LUT87L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT87L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT87L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT87L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT87L_EN		(0x1u<<0)

// LUT87H Configuration

#define	GFXMMU_LUT87H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT87H_LO_0		(0x1u<<4)

// LUT88L Configuration

#define	GFXMMU_LUT88L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT88L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT88L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT88L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT88L_EN		(0x1u<<0)

// LUT88H Configuration

#define	GFXMMU_LUT88H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT88H_LO_0		(0x1u<<4)

// LUT89L Configuration

#define	GFXMMU_LUT89L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT89L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT89L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT89L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT89L_EN		(0x1u<<0)

// LUT89H Configuration

#define	GFXMMU_LUT89H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT89H_LO_0		(0x1u<<4)

// LUT90L Configuration

#define	GFXMMU_LUT90L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT90L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT90L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT90L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT90L_EN		(0x1u<<0)

// LUT90H Configuration

#define	GFXMMU_LUT90H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT90H_LO_0		(0x1u<<4)

// LUT91L Configuration

#define	GFXMMU_LUT91L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT91L_LVB_0		(0x1u<<16)
#define	GFXMMU_LUT91L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT91L_FVB_0		(0x1u<<8)
#define	GFXMMU_LUT91L_EN		(0x1u<<0)

// LUT91H Configuration

