Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
#define	GFXMMU_LUT166H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT166H_LO_0		(0x1u<<4)

// LUT167L Configuration

#define	GFXMMU_LUT167L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT167L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT167L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT167L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT167L_EN		(0x1u<<0)

// LUT167H Configuration

#define	GFXMMU_LUT167H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT167H_LO_0		(0x1u<<4)

// LUT168L Configuration

#define	GFXMMU_LUT168L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT168L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT168L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT168L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT168L_EN		(0x1u<<0)

// LUT168H Configuration

#define	GFXMMU_LUT168H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT168H_LO_0		(0x1u<<4)

// LUT169L Configuration

#define	GFXMMU_LUT169L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT169L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT169L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT169L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT169L_EN		(0x1u<<0)

// LUT169H Configuration

#define	GFXMMU_LUT169H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT169H_LO_0		(0x1u<<4)

// LUT170L Configuration

#define	GFXMMU_LUT170L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT170L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT170L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT170L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT170L_EN		(0x1u<<0)

// LUT170H Configuration

#define	GFXMMU_LUT170H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT170H_LO_0		(0x1u<<4)

// LUT171L Configuration

#define	GFXMMU_LUT171L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT171L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT171L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT171L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT171L_EN		(0x1u<<0)

// LUT171H Configuration

#define	GFXMMU_LUT171H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT171H_LO_0		(0x1u<<4)

// LUT172L Configuration

#define	GFXMMU_LUT172L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT172L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT172L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT172L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT172L_EN		(0x1u<<0)

// LUT172H Configuration

#define	GFXMMU_LUT172H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT172H_LO_0		(0x1u<<4)

// LUT173L Configuration

#define	GFXMMU_LUT173L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT173L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT173L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT173L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT173L_EN		(0x1u<<0)

// LUT173H Configuration

#define	GFXMMU_LUT173H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT173H_LO_0		(0x1u<<4)

// LUT174L Configuration

#define	GFXMMU_LUT174L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT174L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT174L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT174L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT174L_EN		(0x1u<<0)

// LUT174H Configuration

#define	GFXMMU_LUT174H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT174H_LO_0		(0x1u<<4)

// LUT175L Configuration

#define	GFXMMU_LUT175L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT175L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT175L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT175L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT175L_EN		(0x1u<<0)

// LUT175H Configuration

#define	GFXMMU_LUT175H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT175H_LO_0		(0x1u<<4)

// LUT176L Configuration

#define	GFXMMU_LUT176L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT176L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT176L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT176L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT176L_EN		(0x1u<<0)

// LUT176H Configuration

#define	GFXMMU_LUT176H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT176H_LO_0		(0x1u<<4)

// LUT177L Configuration

#define	GFXMMU_LUT177L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT177L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT177L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT177L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT177L_EN		(0x1u<<0)

// LUT177H Configuration

#define	GFXMMU_LUT177H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT177H_LO_0		(0x1u<<4)

// LUT178L Configuration

#define	GFXMMU_LUT178L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT178L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT178L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT178L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT178L_EN		(0x1u<<0)

// LUT178H Configuration

#define	GFXMMU_LUT178H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT178H_LO_0		(0x1u<<4)

// LUT179L Configuration

#define	GFXMMU_LUT179L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT179L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT179L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT179L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT179L_EN		(0x1u<<0)

// LUT179H Configuration

#define	GFXMMU_LUT179H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT179H_LO_0		(0x1u<<4)

// LUT180L Configuration

#define	GFXMMU_LUT180L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT180L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT180L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT180L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT180L_EN		(0x1u<<0)

// LUT180H Configuration

#define	GFXMMU_LUT180H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT180H_LO_0		(0x1u<<4)

// LUT181L Configuration

#define	GFXMMU_LUT181L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT181L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT181L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT181L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT181L_EN		(0x1u<<0)

// LUT181H Configuration

#define	GFXMMU_LUT181H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT181H_LO_0		(0x1u<<4)

// LUT182L Configuration

#define	GFXMMU_LUT182L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT182L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT182L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT182L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT182L_EN		(0x1u<<0)

// LUT182H Configuration

#define	GFXMMU_LUT182H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT182H_LO_0		(0x1u<<4)

// LUT183L Configuration

#define	GFXMMU_LUT183L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT183L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT183L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT183L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT183L_EN		(0x1u<<0)

// LUT183H Configuration

#define	GFXMMU_LUT183H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT183H_LO_0		(0x1u<<4)

// LUT184L Configuration

#define	GFXMMU_LUT184L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT184L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT184L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT184L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT184L_EN		(0x1u<<0)

// LUT184H Configuration

#define	GFXMMU_LUT184H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT184H_LO_0		(0x1u<<4)

