Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
#define	GFXMMU_LUT204L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT204L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT204L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT204L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT204L_EN		(0x1u<<0)

// LUT204H Configuration

#define	GFXMMU_LUT204H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT204H_LO_0		(0x1u<<4)

// LUT205L Configuration

#define	GFXMMU_LUT205L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT205L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT205L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT205L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT205L_EN		(0x1u<<0)

// LUT205H Configuration

#define	GFXMMU_LUT205H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT205H_LO_0		(0x1u<<4)

// LUT206L Configuration

#define	GFXMMU_LUT206L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT206L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT206L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT206L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT206L_EN		(0x1u<<0)

// LUT206H Configuration

#define	GFXMMU_LUT206H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT206H_LO_0		(0x1u<<4)

// LUT207L Configuration

#define	GFXMMU_LUT207L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT207L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT207L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT207L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT207L_EN		(0x1u<<0)

// LUT207H Configuration

#define	GFXMMU_LUT207H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT207H_LO_0		(0x1u<<4)

// LUT208L Configuration

#define	GFXMMU_LUT208L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT208L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT208L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT208L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT208L_EN		(0x1u<<0)

// LUT208H Configuration

#define	GFXMMU_LUT208H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT208H_LO_0		(0x1u<<4)

// LUT209L Configuration

#define	GFXMMU_LUT209L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT209L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT209L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT209L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT209L_EN		(0x1u<<0)

// LUT209H Configuration

#define	GFXMMU_LUT209H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT209H_LO_0		(0x1u<<4)

// LUT210L Configuration

#define	GFXMMU_LUT210L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT210L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT210L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT210L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT210L_EN		(0x1u<<0)

// LUT210H Configuration

#define	GFXMMU_LUT210H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT210H_LO_0		(0x1u<<4)

// LUT211L Configuration

#define	GFXMMU_LUT211L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT211L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT211L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT211L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT211L_EN		(0x1u<<0)

// LUT211H Configuration

#define	GFXMMU_LUT211H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT211H_LO_0		(0x1u<<4)

// LUT212L Configuration

#define	GFXMMU_LUT212L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT212L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT212L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT212L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT212L_EN		(0x1u<<0)

// LUT212H Configuration

#define	GFXMMU_LUT212H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT212H_LO_0		(0x1u<<4)

// LUT213L Configuration

#define	GFXMMU_LUT213L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT213L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT213L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT213L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT213L_EN		(0x1u<<0)

// LUT213H Configuration

#define	GFXMMU_LUT213H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT213H_LO_0		(0x1u<<4)

// LUT214L Configuration

#define	GFXMMU_LUT214L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT214L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT214L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT214L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT214L_EN		(0x1u<<0)

// LUT214H Configuration

#define	GFXMMU_LUT214H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT214H_LO_0		(0x1u<<4)

// LUT215L Configuration

#define	GFXMMU_LUT215L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT215L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT215L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT215L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT215L_EN		(0x1u<<0)

// LUT215H Configuration

#define	GFXMMU_LUT215H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT215H_LO_0		(0x1u<<4)

// LUT216L Configuration

#define	GFXMMU_LUT216L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT216L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT216L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT216L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT216L_EN		(0x1u<<0)

// LUT216H Configuration

#define	GFXMMU_LUT216H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT216H_LO_0		(0x1u<<4)

// LUT217L Configuration

#define	GFXMMU_LUT217L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT217L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT217L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT217L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT217L_EN		(0x1u<<0)

// LUT217H Configuration

#define	GFXMMU_LUT217H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT217H_LO_0		(0x1u<<4)

// LUT218L Configuration

#define	GFXMMU_LUT218L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT218L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT218L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT218L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT218L_EN		(0x1u<<0)

// LUT218H Configuration

#define	GFXMMU_LUT218H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT218H_LO_0		(0x1u<<4)

// LUT219L Configuration

#define	GFXMMU_LUT219L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT219L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT219L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT219L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT219L_EN		(0x1u<<0)

// LUT219H Configuration

#define	GFXMMU_LUT219H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT219H_LO_0		(0x1u<<4)

// LUT220L Configuration

#define	GFXMMU_LUT220L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT220L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT220L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT220L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT220L_EN		(0x1u<<0)

// LUT220H Configuration

#define	GFXMMU_LUT220H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT220H_LO_0		(0x1u<<4)

// LUT221L Configuration

#define	GFXMMU_LUT221L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT221L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT221L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT221L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT221L_EN		(0x1u<<0)

// LUT221H Configuration

#define	GFXMMU_LUT221H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT221H_LO_0		(0x1u<<4)

// LUT222L Configuration

#define	GFXMMU_LUT222L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT222L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT222L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT222L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT222L_EN		(0x1u<<0)

// LUT222H Configuration

#define	GFXMMU_LUT222H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT222H_LO_0		(0x1u<<4)

// LUT223L Configuration

#define	GFXMMU_LUT223L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT223L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT223L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT223L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT223L_EN		(0x1u<<0)

