Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
// LUT223H Configuration

#define	GFXMMU_LUT223H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT223H_LO_0		(0x1u<<4)

// LUT224L Configuration

#define	GFXMMU_LUT224L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT224L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT224L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT224L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT224L_EN		(0x1u<<0)

// LUT224H Configuration

#define	GFXMMU_LUT224H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT224H_LO_0		(0x1u<<4)

// LUT225L Configuration

#define	GFXMMU_LUT225L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT225L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT225L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT225L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT225L_EN		(0x1u<<0)

// LUT225H Configuration

#define	GFXMMU_LUT225H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT225H_LO_0		(0x1u<<4)

// LUT226L Configuration

#define	GFXMMU_LUT226L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT226L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT226L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT226L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT226L_EN		(0x1u<<0)

// LUT226H Configuration

#define	GFXMMU_LUT226H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT226H_LO_0		(0x1u<<4)

// LUT227L Configuration

#define	GFXMMU_LUT227L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT227L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT227L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT227L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT227L_EN		(0x1u<<0)

// LUT227H Configuration

#define	GFXMMU_LUT227H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT227H_LO_0		(0x1u<<4)

// LUT228L Configuration

#define	GFXMMU_LUT228L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT228L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT228L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT228L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT228L_EN		(0x1u<<0)

// LUT228H Configuration

#define	GFXMMU_LUT228H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT228H_LO_0		(0x1u<<4)

// LUT229L Configuration

#define	GFXMMU_LUT229L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT229L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT229L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT229L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT229L_EN		(0x1u<<0)

// LUT229H Configuration

#define	GFXMMU_LUT229H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT229H_LO_0		(0x1u<<4)

// LUT230L Configuration

#define	GFXMMU_LUT230L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT230L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT230L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT230L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT230L_EN		(0x1u<<0)

// LUT230H Configuration

#define	GFXMMU_LUT230H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT230H_LO_0		(0x1u<<4)

// LUT231L Configuration

#define	GFXMMU_LUT231L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT231L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT231L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT231L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT231L_EN		(0x1u<<0)

// LUT231H Configuration

#define	GFXMMU_LUT231H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT231H_LO_0		(0x1u<<4)

// LUT232L Configuration

#define	GFXMMU_LUT232L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT232L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT232L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT232L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT232L_EN		(0x1u<<0)

// LUT232H Configuration

#define	GFXMMU_LUT232H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT232H_LO_0		(0x1u<<4)

// LUT233L Configuration

#define	GFXMMU_LUT233L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT233L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT233L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT233L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT233L_EN		(0x1u<<0)

// LUT233H Configuration

#define	GFXMMU_LUT233H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT233H_LO_0		(0x1u<<4)

// LUT234L Configuration

#define	GFXMMU_LUT234L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT234L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT234L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT234L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT234L_EN		(0x1u<<0)

// LUT234H Configuration

#define	GFXMMU_LUT234H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT234H_LO_0		(0x1u<<4)

// LUT235L Configuration

#define	GFXMMU_LUT235L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT235L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT235L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT235L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT235L_EN		(0x1u<<0)

// LUT235H Configuration

#define	GFXMMU_LUT235H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT235H_LO_0		(0x1u<<4)

// LUT236L Configuration

#define	GFXMMU_LUT236L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT236L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT236L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT236L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT236L_EN		(0x1u<<0)

// LUT236H Configuration

#define	GFXMMU_LUT236H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT236H_LO_0		(0x1u<<4)

// LUT237L Configuration

#define	GFXMMU_LUT237L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT237L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT237L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT237L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT237L_EN		(0x1u<<0)

// LUT237H Configuration

#define	GFXMMU_LUT237H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT237H_LO_0		(0x1u<<4)

// LUT238L Configuration

#define	GFXMMU_LUT238L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT238L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT238L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT238L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT238L_EN		(0x1u<<0)

// LUT238H Configuration

#define	GFXMMU_LUT238H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT238H_LO_0		(0x1u<<4)

// LUT239L Configuration

#define	GFXMMU_LUT239L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT239L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT239L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT239L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT239L_EN		(0x1u<<0)

// LUT239H Configuration

#define	GFXMMU_LUT239H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT239H_LO_0		(0x1u<<4)

// LUT240L Configuration

#define	GFXMMU_LUT240L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT240L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT240L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT240L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT240L_EN		(0x1u<<0)

// LUT240H Configuration

#define	GFXMMU_LUT240H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT240H_LO_0		(0x1u<<4)

// LUT241L Configuration

#define	GFXMMU_LUT241L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT241L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT241L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT241L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT241L_EN		(0x1u<<0)

// LUT241H Configuration

#define	GFXMMU_LUT241H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT241H_LO_0		(0x1u<<4)

// LUT242L Configuration

#define	GFXMMU_LUT242L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT242L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT242L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT242L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT242L_EN		(0x1u<<0)

// LUT242H Configuration

