Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
// LUT261H Configuration

#define	GFXMMU_LUT261H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT261H_LO_0		(0x1u<<4)

// LUT262L Configuration

#define	GFXMMU_LUT262L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT262L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT262L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT262L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT262L_EN		(0x1u<<0)

// LUT262H Configuration

#define	GFXMMU_LUT262H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT262H_LO_0		(0x1u<<4)

// LUT263L Configuration

#define	GFXMMU_LUT263L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT263L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT263L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT263L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT263L_EN		(0x1u<<0)

// LUT263H Configuration

#define	GFXMMU_LUT263H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT263H_LO_0		(0x1u<<4)

// LUT264L Configuration

#define	GFXMMU_LUT264L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT264L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT264L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT264L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT264L_EN		(0x1u<<0)

// LUT264H Configuration

#define	GFXMMU_LUT264H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT264H_LO_0		(0x1u<<4)

// LUT265L Configuration

#define	GFXMMU_LUT265L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT265L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT265L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT265L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT265L_EN		(0x1u<<0)

// LUT265H Configuration

#define	GFXMMU_LUT265H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT265H_LO_0		(0x1u<<4)

// LUT266L Configuration

#define	GFXMMU_LUT266L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT266L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT266L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT266L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT266L_EN		(0x1u<<0)

// LUT266H Configuration

#define	GFXMMU_LUT266H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT266H_LO_0		(0x1u<<4)

// LUT267L Configuration

#define	GFXMMU_LUT267L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT267L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT267L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT267L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT267L_EN		(0x1u<<0)

// LUT267H Configuration

#define	GFXMMU_LUT267H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT267H_LO_0		(0x1u<<4)

// LUT268L Configuration

#define	GFXMMU_LUT268L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT268L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT268L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT268L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT268L_EN		(0x1u<<0)

// LUT268H Configuration

#define	GFXMMU_LUT268H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT268H_LO_0		(0x1u<<4)

// LUT269L Configuration

#define	GFXMMU_LUT269L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT269L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT269L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT269L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT269L_EN		(0x1u<<0)

// LUT269H Configuration

#define	GFXMMU_LUT269H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT269H_LO_0		(0x1u<<4)

// LUT270L Configuration

#define	GFXMMU_LUT270L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT270L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT270L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT270L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT270L_EN		(0x1u<<0)

// LUT270H Configuration

#define	GFXMMU_LUT270H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT270H_LO_0		(0x1u<<4)

// LUT271L Configuration

#define	GFXMMU_LUT271L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT271L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT271L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT271L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT271L_EN		(0x1u<<0)

// LUT271H Configuration

#define	GFXMMU_LUT271H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT271H_LO_0		(0x1u<<4)

// LUT272L Configuration

#define	GFXMMU_LUT272L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT272L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT272L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT272L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT272L_EN		(0x1u<<0)

// LUT272H Configuration

#define	GFXMMU_LUT272H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT272H_LO_0		(0x1u<<4)

// LUT273L Configuration

#define	GFXMMU_LUT273L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT273L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT273L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT273L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT273L_EN		(0x1u<<0)

// LUT273H Configuration

#define	GFXMMU_LUT273H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT273H_LO_0		(0x1u<<4)

// LUT274L Configuration

#define	GFXMMU_LUT274L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT274L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT274L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT274L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT274L_EN		(0x1u<<0)

// LUT274H Configuration

#define	GFXMMU_LUT274H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT274H_LO_0		(0x1u<<4)

// LUT275L Configuration

#define	GFXMMU_LUT275L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT275L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT275L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT275L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT275L_EN		(0x1u<<0)

// LUT275H Configuration

#define	GFXMMU_LUT275H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT275H_LO_0		(0x1u<<4)

// LUT276L Configuration

#define	GFXMMU_LUT276L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT276L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT276L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT276L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT276L_EN		(0x1u<<0)

// LUT276H Configuration

#define	GFXMMU_LUT276H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT276H_LO_0		(0x1u<<4)

// LUT277L Configuration

#define	GFXMMU_LUT277L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT277L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT277L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT277L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT277L_EN		(0x1u<<0)

// LUT277H Configuration

#define	GFXMMU_LUT277H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT277H_LO_0		(0x1u<<4)

// LUT278L Configuration

#define	GFXMMU_LUT278L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT278L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT278L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT278L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT278L_EN		(0x1u<<0)

// LUT278H Configuration

#define	GFXMMU_LUT278H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT278H_LO_0		(0x1u<<4)

// LUT279L Configuration

#define	GFXMMU_LUT279L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT279L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT279L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT279L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT279L_EN		(0x1u<<0)

// LUT279H Configuration

#define	GFXMMU_LUT279H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT279H_LO_0		(0x1u<<4)

