Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
// LUT280L Configuration

#define	GFXMMU_LUT280L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT280L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT280L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT280L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT280L_EN		(0x1u<<0)

// LUT280H Configuration

#define	GFXMMU_LUT280H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT280H_LO_0		(0x1u<<4)

// LUT281L Configuration

#define	GFXMMU_LUT281L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT281L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT281L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT281L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT281L_EN		(0x1u<<0)

// LUT281H Configuration

#define	GFXMMU_LUT281H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT281H_LO_0		(0x1u<<4)

// LUT282L Configuration

#define	GFXMMU_LUT282L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT282L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT282L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT282L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT282L_EN		(0x1u<<0)

// LUT282H Configuration

#define	GFXMMU_LUT282H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT282H_LO_0		(0x1u<<4)

// LUT283L Configuration

#define	GFXMMU_LUT283L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT283L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT283L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT283L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT283L_EN		(0x1u<<0)

// LUT283H Configuration

#define	GFXMMU_LUT283H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT283H_LO_0		(0x1u<<4)

// LUT284L Configuration

#define	GFXMMU_LUT284L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT284L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT284L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT284L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT284L_EN		(0x1u<<0)

// LUT284H Configuration

#define	GFXMMU_LUT284H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT284H_LO_0		(0x1u<<4)

// LUT285L Configuration

#define	GFXMMU_LUT285L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT285L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT285L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT285L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT285L_EN		(0x1u<<0)

// LUT285H Configuration

#define	GFXMMU_LUT285H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT285H_LO_0		(0x1u<<4)

// LUT286L Configuration

#define	GFXMMU_LUT286L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT286L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT286L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT286L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT286L_EN		(0x1u<<0)

// LUT286H Configuration

#define	GFXMMU_LUT286H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT286H_LO_0		(0x1u<<4)

// LUT287L Configuration

#define	GFXMMU_LUT287L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT287L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT287L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT287L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT287L_EN		(0x1u<<0)

// LUT287H Configuration

#define	GFXMMU_LUT287H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT287H_LO_0		(0x1u<<4)

// LUT288L Configuration

#define	GFXMMU_LUT288L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT288L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT288L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT288L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT288L_EN		(0x1u<<0)

// LUT288H Configuration

#define	GFXMMU_LUT288H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT288H_LO_0		(0x1u<<4)

// LUT289L Configuration

#define	GFXMMU_LUT289L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT289L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT289L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT289L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT289L_EN		(0x1u<<0)

// LUT289H Configuration

#define	GFXMMU_LUT289H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT289H_LO_0		(0x1u<<4)

// LUT290L Configuration

#define	GFXMMU_LUT290L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT290L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT290L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT290L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT290L_EN		(0x1u<<0)

// LUT290H Configuration

#define	GFXMMU_LUT290H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT290H_LO_0		(0x1u<<4)

// LUT291L Configuration

#define	GFXMMU_LUT291L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT291L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT291L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT291L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT291L_EN		(0x1u<<0)

// LUT291H Configuration

#define	GFXMMU_LUT291H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT291H_LO_0		(0x1u<<4)

// LUT292L Configuration

#define	GFXMMU_LUT292L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT292L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT292L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT292L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT292L_EN		(0x1u<<0)

// LUT292H Configuration

#define	GFXMMU_LUT292H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT292H_LO_0		(0x1u<<4)

// LUT293L Configuration

#define	GFXMMU_LUT293L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT293L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT293L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT293L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT293L_EN		(0x1u<<0)

// LUT293H Configuration

#define	GFXMMU_LUT293H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT293H_LO_0		(0x1u<<4)

// LUT294L Configuration

#define	GFXMMU_LUT294L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT294L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT294L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT294L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT294L_EN		(0x1u<<0)

// LUT294H Configuration

#define	GFXMMU_LUT294H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT294H_LO_0		(0x1u<<4)

// LUT295L Configuration

#define	GFXMMU_LUT295L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT295L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT295L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT295L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT295L_EN		(0x1u<<0)

// LUT295H Configuration

#define	GFXMMU_LUT295H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT295H_LO_0		(0x1u<<4)

// LUT296L Configuration

#define	GFXMMU_LUT296L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT296L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT296L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT296L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT296L_EN		(0x1u<<0)

// LUT296H Configuration

#define	GFXMMU_LUT296H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT296H_LO_0		(0x1u<<4)

// LUT297L Configuration

#define	GFXMMU_LUT297L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT297L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT297L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT297L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT297L_EN		(0x1u<<0)

// LUT297H Configuration

#define	GFXMMU_LUT297H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT297H_LO_0		(0x1u<<4)

// LUT298L Configuration

#define	GFXMMU_LUT298L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT298L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT298L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT298L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT298L_EN		(0x1u<<0)

// LUT298H Configuration

#define	GFXMMU_LUT298H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT298H_LO_0		(0x1u<<4)

// LUT299L Configuration

#define	GFXMMU_LUT299L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT299L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT299L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT299L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT299L_EN		(0x1u<<0)

// LUT299H Configuration

#define	GFXMMU_LUT299H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT299H_LO_0		(0x1u<<4)

// LUT300L Configuration

