Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
#define	GFXMMU_LUT300L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT300L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT300L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT300L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT300L_EN		(0x1u<<0)

// LUT300H Configuration

#define	GFXMMU_LUT300H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT300H_LO_0		(0x1u<<4)

// LUT301L Configuration

#define	GFXMMU_LUT301L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT301L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT301L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT301L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT301L_EN		(0x1u<<0)

// LUT301H Configuration

#define	GFXMMU_LUT301H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT301H_LO_0		(0x1u<<4)

// LUT302L Configuration

#define	GFXMMU_LUT302L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT302L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT302L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT302L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT302L_EN		(0x1u<<0)

// LUT302H Configuration

#define	GFXMMU_LUT302H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT302H_LO_0		(0x1u<<4)

// LUT303L Configuration

#define	GFXMMU_LUT303L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT303L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT303L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT303L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT303L_EN		(0x1u<<0)

// LUT303H Configuration

#define	GFXMMU_LUT303H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT303H_LO_0		(0x1u<<4)

// LUT304L Configuration

#define	GFXMMU_LUT304L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT304L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT304L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT304L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT304L_EN		(0x1u<<0)

// LUT304H Configuration

#define	GFXMMU_LUT304H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT304H_LO_0		(0x1u<<4)

// LUT305L Configuration

#define	GFXMMU_LUT305L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT305L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT305L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT305L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT305L_EN		(0x1u<<0)

// LUT305H Configuration

#define	GFXMMU_LUT305H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT305H_LO_0		(0x1u<<4)

// LUT306L Configuration

#define	GFXMMU_LUT306L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT306L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT306L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT306L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT306L_EN		(0x1u<<0)

// LUT306H Configuration

#define	GFXMMU_LUT306H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT306H_LO_0		(0x1u<<4)

// LUT307L Configuration

#define	GFXMMU_LUT307L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT307L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT307L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT307L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT307L_EN		(0x1u<<0)

// LUT307H Configuration

#define	GFXMMU_LUT307H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT307H_LO_0		(0x1u<<4)

// LUT308L Configuration

#define	GFXMMU_LUT308L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT308L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT308L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT308L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT308L_EN		(0x1u<<0)

// LUT308H Configuration

#define	GFXMMU_LUT308H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT308H_LO_0		(0x1u<<4)

// LUT309L Configuration

#define	GFXMMU_LUT309L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT309L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT309L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT309L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT309L_EN		(0x1u<<0)

// LUT309H Configuration

#define	GFXMMU_LUT309H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT309H_LO_0		(0x1u<<4)

// LUT310L Configuration

#define	GFXMMU_LUT310L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT310L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT310L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT310L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT310L_EN		(0x1u<<0)

// LUT310H Configuration

#define	GFXMMU_LUT310H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT310H_LO_0		(0x1u<<4)

// LUT311L Configuration

#define	GFXMMU_LUT311L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT311L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT311L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT311L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT311L_EN		(0x1u<<0)

// LUT311H Configuration

#define	GFXMMU_LUT311H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT311H_LO_0		(0x1u<<4)

// LUT312L Configuration

#define	GFXMMU_LUT312L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT312L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT312L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT312L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT312L_EN		(0x1u<<0)

// LUT312H Configuration

#define	GFXMMU_LUT312H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT312H_LO_0		(0x1u<<4)

// LUT313L Configuration

#define	GFXMMU_LUT313L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT313L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT313L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT313L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT313L_EN		(0x1u<<0)

// LUT313H Configuration

#define	GFXMMU_LUT313H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT313H_LO_0		(0x1u<<4)

// LUT314L Configuration

#define	GFXMMU_LUT314L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT314L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT314L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT314L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT314L_EN		(0x1u<<0)

// LUT314H Configuration

#define	GFXMMU_LUT314H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT314H_LO_0		(0x1u<<4)

// LUT315L Configuration

#define	GFXMMU_LUT315L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT315L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT315L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT315L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT315L_EN		(0x1u<<0)

// LUT315H Configuration

#define	GFXMMU_LUT315H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT315H_LO_0		(0x1u<<4)

// LUT316L Configuration

#define	GFXMMU_LUT316L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT316L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT316L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT316L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT316L_EN		(0x1u<<0)

// LUT316H Configuration

#define	GFXMMU_LUT316H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT316H_LO_0		(0x1u<<4)

// LUT317L Configuration

#define	GFXMMU_LUT317L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT317L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT317L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT317L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT317L_EN		(0x1u<<0)

// LUT317H Configuration

#define	GFXMMU_LUT317H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT317H_LO_0		(0x1u<<4)

// LUT318L Configuration

#define	GFXMMU_LUT318L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT318L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT318L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT318L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT318L_EN		(0x1u<<0)

