Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
// LUT318H Configuration

#define	GFXMMU_LUT318H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT318H_LO_0		(0x1u<<4)

// LUT319L Configuration

#define	GFXMMU_LUT319L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT319L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT319L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT319L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT319L_EN		(0x1u<<0)

// LUT319H Configuration

#define	GFXMMU_LUT319H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT319H_LO_0		(0x1u<<4)

// LUT320L Configuration

#define	GFXMMU_LUT320L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT320L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT320L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT320L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT320L_EN		(0x1u<<0)

// LUT320H Configuration

#define	GFXMMU_LUT320H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT320H_LO_0		(0x1u<<4)

// LUT321L Configuration

#define	GFXMMU_LUT321L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT321L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT321L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT321L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT321L_EN		(0x1u<<0)

// LUT321H Configuration

#define	GFXMMU_LUT321H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT321H_LO_0		(0x1u<<4)

// LUT322L Configuration

#define	GFXMMU_LUT322L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT322L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT322L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT322L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT322L_EN		(0x1u<<0)

// LUT322H Configuration

#define	GFXMMU_LUT322H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT322H_LO_0		(0x1u<<4)

// LUT323L Configuration

#define	GFXMMU_LUT323L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT323L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT323L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT323L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT323L_EN		(0x1u<<0)

// LUT323H Configuration

#define	GFXMMU_LUT323H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT323H_LO_0		(0x1u<<4)

// LUT324L Configuration

#define	GFXMMU_LUT324L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT324L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT324L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT324L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT324L_EN		(0x1u<<0)

// LUT324H Configuration

#define	GFXMMU_LUT324H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT324H_LO_0		(0x1u<<4)

// LUT325L Configuration

#define	GFXMMU_LUT325L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT325L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT325L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT325L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT325L_EN		(0x1u<<0)

// LUT325H Configuration

#define	GFXMMU_LUT325H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT325H_LO_0		(0x1u<<4)

// LUT326L Configuration

#define	GFXMMU_LUT326L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT326L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT326L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT326L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT326L_EN		(0x1u<<0)

// LUT326H Configuration

#define	GFXMMU_LUT326H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT326H_LO_0		(0x1u<<4)

// LUT327L Configuration

#define	GFXMMU_LUT327L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT327L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT327L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT327L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT327L_EN		(0x1u<<0)

// LUT327H Configuration

#define	GFXMMU_LUT327H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT327H_LO_0		(0x1u<<4)

// LUT328L Configuration

#define	GFXMMU_LUT328L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT328L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT328L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT328L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT328L_EN		(0x1u<<0)

// LUT328H Configuration

#define	GFXMMU_LUT328H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT328H_LO_0		(0x1u<<4)

// LUT329L Configuration

#define	GFXMMU_LUT329L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT329L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT329L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT329L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT329L_EN		(0x1u<<0)

// LUT329H Configuration

#define	GFXMMU_LUT329H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT329H_LO_0		(0x1u<<4)

// LUT330L Configuration

#define	GFXMMU_LUT330L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT330L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT330L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT330L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT330L_EN		(0x1u<<0)

// LUT330H Configuration

#define	GFXMMU_LUT330H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT330H_LO_0		(0x1u<<4)

// LUT331L Configuration

#define	GFXMMU_LUT331L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT331L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT331L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT331L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT331L_EN		(0x1u<<0)

// LUT331H Configuration

#define	GFXMMU_LUT331H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT331H_LO_0		(0x1u<<4)

// LUT332L Configuration

#define	GFXMMU_LUT332L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT332L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT332L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT332L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT332L_EN		(0x1u<<0)

// LUT332H Configuration

#define	GFXMMU_LUT332H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT332H_LO_0		(0x1u<<4)

// LUT333L Configuration

#define	GFXMMU_LUT333L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT333L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT333L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT333L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT333L_EN		(0x1u<<0)

// LUT333H Configuration

#define	GFXMMU_LUT333H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT333H_LO_0		(0x1u<<4)

// LUT334L Configuration

#define	GFXMMU_LUT334L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT334L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT334L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT334L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT334L_EN		(0x1u<<0)

// LUT334H Configuration

#define	GFXMMU_LUT334H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT334H_LO_0		(0x1u<<4)

// LUT335L Configuration

#define	GFXMMU_LUT335L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT335L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT335L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT335L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT335L_EN		(0x1u<<0)

// LUT335H Configuration

#define	GFXMMU_LUT335H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT335H_LO_0		(0x1u<<4)

// LUT336L Configuration

#define	GFXMMU_LUT336L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT336L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT336L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT336L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT336L_EN		(0x1u<<0)

// LUT336H Configuration

#define	GFXMMU_LUT336H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT336H_LO_0		(0x1u<<4)

// LUT337L Configuration

#define	GFXMMU_LUT337L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT337L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT337L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT337L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT337L_EN		(0x1u<<0)

// LUT337H Configuration

#define	GFXMMU_LUT337H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT337H_LO_0		(0x1u<<4)

