Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
// LUT338L Configuration

#define	GFXMMU_LUT338L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT338L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT338L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT338L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT338L_EN		(0x1u<<0)

// LUT338H Configuration

#define	GFXMMU_LUT338H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT338H_LO_0		(0x1u<<4)

// LUT339L Configuration

#define	GFXMMU_LUT339L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT339L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT339L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT339L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT339L_EN		(0x1u<<0)

// LUT339H Configuration

#define	GFXMMU_LUT339H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT339H_LO_0		(0x1u<<4)

// LUT340L Configuration

#define	GFXMMU_LUT340L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT340L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT340L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT340L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT340L_EN		(0x1u<<0)

// LUT340H Configuration

#define	GFXMMU_LUT340H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT340H_LO_0		(0x1u<<4)

// LUT341L Configuration

#define	GFXMMU_LUT341L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT341L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT341L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT341L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT341L_EN		(0x1u<<0)

// LUT341H Configuration

#define	GFXMMU_LUT341H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT341H_LO_0		(0x1u<<4)

// LUT342L Configuration

#define	GFXMMU_LUT342L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT342L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT342L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT342L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT342L_EN		(0x1u<<0)

// LUT342H Configuration

#define	GFXMMU_LUT342H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT342H_LO_0		(0x1u<<4)

// LUT343L Configuration

#define	GFXMMU_LUT343L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT343L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT343L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT343L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT343L_EN		(0x1u<<0)

// LUT343H Configuration

#define	GFXMMU_LUT343H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT343H_LO_0		(0x1u<<4)

// LUT344L Configuration

#define	GFXMMU_LUT344L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT344L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT344L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT344L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT344L_EN		(0x1u<<0)

// LUT344H Configuration

#define	GFXMMU_LUT344H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT344H_LO_0		(0x1u<<4)

// LUT345L Configuration

#define	GFXMMU_LUT345L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT345L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT345L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT345L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT345L_EN		(0x1u<<0)

// LUT345H Configuration

#define	GFXMMU_LUT345H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT345H_LO_0		(0x1u<<4)

// LUT346L Configuration

#define	GFXMMU_LUT346L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT346L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT346L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT346L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT346L_EN		(0x1u<<0)

// LUT346H Configuration

#define	GFXMMU_LUT346H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT346H_LO_0		(0x1u<<4)

// LUT347L Configuration

#define	GFXMMU_LUT347L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT347L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT347L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT347L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT347L_EN		(0x1u<<0)

// LUT347H Configuration

#define	GFXMMU_LUT347H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT347H_LO_0		(0x1u<<4)

// LUT348L Configuration

#define	GFXMMU_LUT348L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT348L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT348L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT348L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT348L_EN		(0x1u<<0)

// LUT348H Configuration

#define	GFXMMU_LUT348H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT348H_LO_0		(0x1u<<4)

// LUT349L Configuration

#define	GFXMMU_LUT349L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT349L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT349L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT349L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT349L_EN		(0x1u<<0)

// LUT349H Configuration

#define	GFXMMU_LUT349H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT349H_LO_0		(0x1u<<4)

// LUT350L Configuration

#define	GFXMMU_LUT350L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT350L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT350L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT350L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT350L_EN		(0x1u<<0)

// LUT350H Configuration

#define	GFXMMU_LUT350H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT350H_LO_0		(0x1u<<4)

// LUT351L Configuration

#define	GFXMMU_LUT351L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT351L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT351L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT351L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT351L_EN		(0x1u<<0)

// LUT351H Configuration

#define	GFXMMU_LUT351H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT351H_LO_0		(0x1u<<4)

// LUT352L Configuration

#define	GFXMMU_LUT352L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT352L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT352L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT352L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT352L_EN		(0x1u<<0)

// LUT352H Configuration

#define	GFXMMU_LUT352H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT352H_LO_0		(0x1u<<4)

// LUT353L Configuration

#define	GFXMMU_LUT353L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT353L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT353L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT353L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT353L_EN		(0x1u<<0)

// LUT353H Configuration

#define	GFXMMU_LUT353H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT353H_LO_0		(0x1u<<4)

// LUT354L Configuration

#define	GFXMMU_LUT354L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT354L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT354L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT354L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT354L_EN		(0x1u<<0)

// LUT354H Configuration

#define	GFXMMU_LUT354H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT354H_LO_0		(0x1u<<4)

// LUT355L Configuration

#define	GFXMMU_LUT355L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT355L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT355L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT355L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT355L_EN		(0x1u<<0)

// LUT355H Configuration

#define	GFXMMU_LUT355H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT355H_LO_0		(0x1u<<4)

// LUT356L Configuration

#define	GFXMMU_LUT356L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT356L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT356L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT356L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT356L_EN		(0x1u<<0)

