Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
#define	GFXMMU_LUT375H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT375H_LO_0		(0x1u<<4)

// LUT376L Configuration

#define	GFXMMU_LUT376L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT376L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT376L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT376L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT376L_EN		(0x1u<<0)

// LUT376H Configuration

#define	GFXMMU_LUT376H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT376H_LO_0		(0x1u<<4)

// LUT377L Configuration

#define	GFXMMU_LUT377L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT377L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT377L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT377L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT377L_EN		(0x1u<<0)

// LUT377H Configuration

#define	GFXMMU_LUT377H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT377H_LO_0		(0x1u<<4)

// LUT378L Configuration

#define	GFXMMU_LUT378L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT378L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT378L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT378L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT378L_EN		(0x1u<<0)

// LUT378H Configuration

#define	GFXMMU_LUT378H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT378H_LO_0		(0x1u<<4)

// LUT379L Configuration

#define	GFXMMU_LUT379L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT379L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT379L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT379L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT379L_EN		(0x1u<<0)

// LUT379H Configuration

#define	GFXMMU_LUT379H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT379H_LO_0		(0x1u<<4)

// LUT380L Configuration

#define	GFXMMU_LUT380L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT380L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT380L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT380L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT380L_EN		(0x1u<<0)

// LUT380H Configuration

#define	GFXMMU_LUT380H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT380H_LO_0		(0x1u<<4)

// LUT381L Configuration

#define	GFXMMU_LUT381L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT381L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT381L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT381L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT381L_EN		(0x1u<<0)

// LUT381H Configuration

#define	GFXMMU_LUT381H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT381H_LO_0		(0x1u<<4)

// LUT382L Configuration

#define	GFXMMU_LUT382L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT382L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT382L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT382L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT382L_EN		(0x1u<<0)

// LUT382H Configuration

#define	GFXMMU_LUT382H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT382H_LO_0		(0x1u<<4)

// LUT383L Configuration

#define	GFXMMU_LUT383L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT383L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT383L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT383L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT383L_EN		(0x1u<<0)

// LUT383H Configuration

#define	GFXMMU_LUT383H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT383H_LO_0		(0x1u<<4)

// LUT384L Configuration

#define	GFXMMU_LUT384L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT384L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT384L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT384L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT384L_EN		(0x1u<<0)

// LUT384H Configuration

#define	GFXMMU_LUT384H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT384H_LO_0		(0x1u<<4)

// LUT385L Configuration

#define	GFXMMU_LUT385L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT385L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT385L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT385L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT385L_EN		(0x1u<<0)

// LUT385H Configuration

#define	GFXMMU_LUT385H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT385H_LO_0		(0x1u<<4)

// LUT386L Configuration

#define	GFXMMU_LUT386L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT386L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT386L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT386L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT386L_EN		(0x1u<<0)

// LUT386H Configuration

#define	GFXMMU_LUT386H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT386H_LO_0		(0x1u<<4)

// LUT387L Configuration

#define	GFXMMU_LUT387L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT387L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT387L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT387L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT387L_EN		(0x1u<<0)

// LUT387H Configuration

#define	GFXMMU_LUT387H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT387H_LO_0		(0x1u<<4)

// LUT388L Configuration

#define	GFXMMU_LUT388L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT388L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT388L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT388L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT388L_EN		(0x1u<<0)

// LUT388H Configuration

#define	GFXMMU_LUT388H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT388H_LO_0		(0x1u<<4)

// LUT389L Configuration

#define	GFXMMU_LUT389L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT389L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT389L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT389L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT389L_EN		(0x1u<<0)

// LUT389H Configuration

#define	GFXMMU_LUT389H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT389H_LO_0		(0x1u<<4)

// LUT390L Configuration

#define	GFXMMU_LUT390L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT390L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT390L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT390L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT390L_EN		(0x1u<<0)

// LUT390H Configuration

#define	GFXMMU_LUT390H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT390H_LO_0		(0x1u<<4)

// LUT391L Configuration

#define	GFXMMU_LUT391L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT391L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT391L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT391L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT391L_EN		(0x1u<<0)

// LUT391H Configuration

#define	GFXMMU_LUT391H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT391H_LO_0		(0x1u<<4)

// LUT392L Configuration

#define	GFXMMU_LUT392L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT392L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT392L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT392L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT392L_EN		(0x1u<<0)

// LUT392H Configuration

#define	GFXMMU_LUT392H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT392H_LO_0		(0x1u<<4)

// LUT393L Configuration

#define	GFXMMU_LUT393L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT393L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT393L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT393L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT393L_EN		(0x1u<<0)

// LUT393H Configuration

#define	GFXMMU_LUT393H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT393H_LO_0		(0x1u<<4)

// LUT394L Configuration

#define	GFXMMU_LUT394L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT394L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT394L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT394L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT394L_EN		(0x1u<<0)

// LUT394H Configuration

#define	GFXMMU_LUT394H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT394H_LO_0		(0x1u<<4)

