Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
#define	GFXMMU_LUT432H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT432H_LO_0		(0x1u<<4)

// LUT433L Configuration

#define	GFXMMU_LUT433L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT433L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT433L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT433L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT433L_EN		(0x1u<<0)

// LUT433H Configuration

#define	GFXMMU_LUT433H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT433H_LO_0		(0x1u<<4)

// LUT434L Configuration

#define	GFXMMU_LUT434L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT434L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT434L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT434L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT434L_EN		(0x1u<<0)

// LUT434H Configuration

#define	GFXMMU_LUT434H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT434H_LO_0		(0x1u<<4)

// LUT435L Configuration

#define	GFXMMU_LUT435L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT435L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT435L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT435L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT435L_EN		(0x1u<<0)

// LUT435H Configuration

#define	GFXMMU_LUT435H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT435H_LO_0		(0x1u<<4)

// LUT436L Configuration

#define	GFXMMU_LUT436L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT436L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT436L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT436L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT436L_EN		(0x1u<<0)

// LUT436H Configuration

#define	GFXMMU_LUT436H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT436H_LO_0		(0x1u<<4)

// LUT437L Configuration

#define	GFXMMU_LUT437L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT437L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT437L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT437L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT437L_EN		(0x1u<<0)

// LUT437H Configuration

#define	GFXMMU_LUT437H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT437H_LO_0		(0x1u<<4)

// LUT438L Configuration

#define	GFXMMU_LUT438L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT438L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT438L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT438L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT438L_EN		(0x1u<<0)

// LUT438H Configuration

#define	GFXMMU_LUT438H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT438H_LO_0		(0x1u<<4)

// LUT439L Configuration

#define	GFXMMU_LUT439L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT439L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT439L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT439L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT439L_EN		(0x1u<<0)

// LUT439H Configuration

#define	GFXMMU_LUT439H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT439H_LO_0		(0x1u<<4)

// LUT440L Configuration

#define	GFXMMU_LUT440L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT440L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT440L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT440L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT440L_EN		(0x1u<<0)

// LUT440H Configuration

#define	GFXMMU_LUT440H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT440H_LO_0		(0x1u<<4)

// LUT441L Configuration

#define	GFXMMU_LUT441L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT441L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT441L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT441L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT441L_EN		(0x1u<<0)

// LUT441H Configuration

#define	GFXMMU_LUT441H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT441H_LO_0		(0x1u<<4)

// LUT442L Configuration

#define	GFXMMU_LUT442L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT442L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT442L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT442L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT442L_EN		(0x1u<<0)

// LUT442H Configuration

#define	GFXMMU_LUT442H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT442H_LO_0		(0x1u<<4)

// LUT443L Configuration

#define	GFXMMU_LUT443L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT443L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT443L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT443L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT443L_EN		(0x1u<<0)

// LUT443H Configuration

#define	GFXMMU_LUT443H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT443H_LO_0		(0x1u<<4)

// LUT444L Configuration

#define	GFXMMU_LUT444L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT444L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT444L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT444L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT444L_EN		(0x1u<<0)

// LUT444H Configuration

#define	GFXMMU_LUT444H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT444H_LO_0		(0x1u<<4)

// LUT445L Configuration

#define	GFXMMU_LUT445L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT445L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT445L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT445L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT445L_EN		(0x1u<<0)

// LUT445H Configuration

#define	GFXMMU_LUT445H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT445H_LO_0		(0x1u<<4)

// LUT446L Configuration

#define	GFXMMU_LUT446L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT446L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT446L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT446L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT446L_EN		(0x1u<<0)

// LUT446H Configuration

#define	GFXMMU_LUT446H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT446H_LO_0		(0x1u<<4)

// LUT447L Configuration

#define	GFXMMU_LUT447L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT447L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT447L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT447L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT447L_EN		(0x1u<<0)

// LUT447H Configuration

#define	GFXMMU_LUT447H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT447H_LO_0		(0x1u<<4)

// LUT448L Configuration

#define	GFXMMU_LUT448L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT448L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT448L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT448L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT448L_EN		(0x1u<<0)

// LUT448H Configuration

#define	GFXMMU_LUT448H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT448H_LO_0		(0x1u<<4)

// LUT449L Configuration

#define	GFXMMU_LUT449L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT449L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT449L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT449L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT449L_EN		(0x1u<<0)

// LUT449H Configuration

#define	GFXMMU_LUT449H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT449H_LO_0		(0x1u<<4)

// LUT450L Configuration

#define	GFXMMU_LUT450L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT450L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT450L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT450L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT450L_EN		(0x1u<<0)

// LUT450H Configuration

#define	GFXMMU_LUT450H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT450H_LO_0		(0x1u<<4)

// LUT451L Configuration

#define	GFXMMU_LUT451L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT451L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT451L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT451L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT451L_EN		(0x1u<<0)

// LUT451H Configuration

