Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
#define	GFXMMU_LUT451H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT451H_LO_0		(0x1u<<4)

// LUT452L Configuration

#define	GFXMMU_LUT452L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT452L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT452L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT452L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT452L_EN		(0x1u<<0)

// LUT452H Configuration

#define	GFXMMU_LUT452H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT452H_LO_0		(0x1u<<4)

// LUT453L Configuration

#define	GFXMMU_LUT453L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT453L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT453L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT453L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT453L_EN		(0x1u<<0)

// LUT453H Configuration

#define	GFXMMU_LUT453H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT453H_LO_0		(0x1u<<4)

// LUT454L Configuration

#define	GFXMMU_LUT454L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT454L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT454L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT454L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT454L_EN		(0x1u<<0)

// LUT454H Configuration

#define	GFXMMU_LUT454H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT454H_LO_0		(0x1u<<4)

// LUT455L Configuration

#define	GFXMMU_LUT455L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT455L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT455L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT455L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT455L_EN		(0x1u<<0)

// LUT455H Configuration

#define	GFXMMU_LUT455H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT455H_LO_0		(0x1u<<4)

// LUT456L Configuration

#define	GFXMMU_LUT456L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT456L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT456L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT456L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT456L_EN		(0x1u<<0)

// LUT456H Configuration

#define	GFXMMU_LUT456H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT456H_LO_0		(0x1u<<4)

// LUT457L Configuration

#define	GFXMMU_LUT457L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT457L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT457L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT457L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT457L_EN		(0x1u<<0)

// LUT457H Configuration

#define	GFXMMU_LUT457H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT457H_LO_0		(0x1u<<4)

// LUT458L Configuration

#define	GFXMMU_LUT458L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT458L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT458L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT458L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT458L_EN		(0x1u<<0)

// LUT458H Configuration

#define	GFXMMU_LUT458H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT458H_LO_0		(0x1u<<4)

// LUT459L Configuration

#define	GFXMMU_LUT459L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT459L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT459L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT459L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT459L_EN		(0x1u<<0)

// LUT459H Configuration

#define	GFXMMU_LUT459H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT459H_LO_0		(0x1u<<4)

// LUT460L Configuration

#define	GFXMMU_LUT460L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT460L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT460L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT460L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT460L_EN		(0x1u<<0)

// LUT460H Configuration

#define	GFXMMU_LUT460H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT460H_LO_0		(0x1u<<4)

// LUT461L Configuration

#define	GFXMMU_LUT461L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT461L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT461L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT461L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT461L_EN		(0x1u<<0)

// LUT461H Configuration

#define	GFXMMU_LUT461H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT461H_LO_0		(0x1u<<4)

// LUT462L Configuration

#define	GFXMMU_LUT462L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT462L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT462L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT462L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT462L_EN		(0x1u<<0)

// LUT462H Configuration

#define	GFXMMU_LUT462H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT462H_LO_0		(0x1u<<4)

// LUT463L Configuration

#define	GFXMMU_LUT463L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT463L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT463L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT463L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT463L_EN		(0x1u<<0)

// LUT463H Configuration

#define	GFXMMU_LUT463H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT463H_LO_0		(0x1u<<4)

// LUT464L Configuration

#define	GFXMMU_LUT464L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT464L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT464L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT464L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT464L_EN		(0x1u<<0)

// LUT464H Configuration

#define	GFXMMU_LUT464H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT464H_LO_0		(0x1u<<4)

// LUT465L Configuration

#define	GFXMMU_LUT465L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT465L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT465L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT465L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT465L_EN		(0x1u<<0)

// LUT465H Configuration

#define	GFXMMU_LUT465H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT465H_LO_0		(0x1u<<4)

// LUT466L Configuration

#define	GFXMMU_LUT466L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT466L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT466L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT466L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT466L_EN		(0x1u<<0)

// LUT466H Configuration

#define	GFXMMU_LUT466H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT466H_LO_0		(0x1u<<4)

// LUT467L Configuration

#define	GFXMMU_LUT467L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT467L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT467L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT467L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT467L_EN		(0x1u<<0)

// LUT467H Configuration

#define	GFXMMU_LUT467H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT467H_LO_0		(0x1u<<4)

// LUT468L Configuration

#define	GFXMMU_LUT468L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT468L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT468L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT468L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT468L_EN		(0x1u<<0)

// LUT468H Configuration

#define	GFXMMU_LUT468H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT468H_LO_0		(0x1u<<4)

// LUT469L Configuration

#define	GFXMMU_LUT469L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT469L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT469L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT469L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT469L_EN		(0x1u<<0)

// LUT469H Configuration

#define	GFXMMU_LUT469H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT469H_LO_0		(0x1u<<4)

