Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
// LUT489H Configuration

#define	GFXMMU_LUT489H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT489H_LO_0		(0x1u<<4)

// LUT490L Configuration

#define	GFXMMU_LUT490L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT490L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT490L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT490L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT490L_EN		(0x1u<<0)

// LUT490H Configuration

#define	GFXMMU_LUT490H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT490H_LO_0		(0x1u<<4)

// LUT491L Configuration

#define	GFXMMU_LUT491L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT491L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT491L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT491L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT491L_EN		(0x1u<<0)

// LUT491H Configuration

#define	GFXMMU_LUT491H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT491H_LO_0		(0x1u<<4)

// LUT492L Configuration

#define	GFXMMU_LUT492L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT492L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT492L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT492L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT492L_EN		(0x1u<<0)

// LUT492H Configuration

#define	GFXMMU_LUT492H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT492H_LO_0		(0x1u<<4)

// LUT493L Configuration

#define	GFXMMU_LUT493L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT493L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT493L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT493L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT493L_EN		(0x1u<<0)

// LUT493H Configuration

#define	GFXMMU_LUT493H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT493H_LO_0		(0x1u<<4)

// LUT494L Configuration

#define	GFXMMU_LUT494L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT494L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT494L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT494L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT494L_EN		(0x1u<<0)

// LUT494H Configuration

#define	GFXMMU_LUT494H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT494H_LO_0		(0x1u<<4)

// LUT495L Configuration

#define	GFXMMU_LUT495L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT495L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT495L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT495L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT495L_EN		(0x1u<<0)

// LUT495H Configuration

#define	GFXMMU_LUT495H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT495H_LO_0		(0x1u<<4)

// LUT496L Configuration

#define	GFXMMU_LUT496L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT496L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT496L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT496L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT496L_EN		(0x1u<<0)

// LUT496H Configuration

#define	GFXMMU_LUT496H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT496H_LO_0		(0x1u<<4)

// LUT497L Configuration

#define	GFXMMU_LUT497L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT497L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT497L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT497L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT497L_EN		(0x1u<<0)

// LUT497H Configuration

#define	GFXMMU_LUT497H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT497H_LO_0		(0x1u<<4)

// LUT498L Configuration

#define	GFXMMU_LUT498L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT498L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT498L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT498L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT498L_EN		(0x1u<<0)

// LUT498H Configuration

#define	GFXMMU_LUT498H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT498H_LO_0		(0x1u<<4)

// LUT499L Configuration

#define	GFXMMU_LUT499L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT499L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT499L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT499L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT499L_EN		(0x1u<<0)

// LUT499H Configuration

#define	GFXMMU_LUT499H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT499H_LO_0		(0x1u<<4)

// LUT500L Configuration

#define	GFXMMU_LUT500L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT500L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT500L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT500L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT500L_EN		(0x1u<<0)

// LUT500H Configuration

#define	GFXMMU_LUT500H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT500H_LO_0		(0x1u<<4)

// LUT501L Configuration

#define	GFXMMU_LUT501L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT501L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT501L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT501L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT501L_EN		(0x1u<<0)

// LUT501H Configuration

#define	GFXMMU_LUT501H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT501H_LO_0		(0x1u<<4)

// LUT502L Configuration

#define	GFXMMU_LUT502L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT502L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT502L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT502L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT502L_EN		(0x1u<<0)

// LUT502H Configuration

#define	GFXMMU_LUT502H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT502H_LO_0		(0x1u<<4)

// LUT503L Configuration

#define	GFXMMU_LUT503L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT503L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT503L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT503L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT503L_EN		(0x1u<<0)

// LUT503H Configuration

#define	GFXMMU_LUT503H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT503H_LO_0		(0x1u<<4)

// LUT504L Configuration

#define	GFXMMU_LUT504L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT504L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT504L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT504L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT504L_EN		(0x1u<<0)

// LUT504H Configuration

#define	GFXMMU_LUT504H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT504H_LO_0		(0x1u<<4)

// LUT505L Configuration

#define	GFXMMU_LUT505L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT505L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT505L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT505L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT505L_EN		(0x1u<<0)

// LUT505H Configuration

#define	GFXMMU_LUT505H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT505H_LO_0		(0x1u<<4)

// LUT506L Configuration

#define	GFXMMU_LUT506L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT506L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT506L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT506L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT506L_EN		(0x1u<<0)

// LUT506H Configuration

#define	GFXMMU_LUT506H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT506H_LO_0		(0x1u<<4)

// LUT507L Configuration

#define	GFXMMU_LUT507L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT507L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT507L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT507L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT507L_EN		(0x1u<<0)

// LUT507H Configuration

#define	GFXMMU_LUT507H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT507H_LO_0		(0x1u<<4)

// LUT508L Configuration

#define	GFXMMU_LUT508L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT508L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT508L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT508L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT508L_EN		(0x1u<<0)

// LUT508H Configuration

#define	GFXMMU_LUT508H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT508H_LO_0		(0x1u<<4)

