Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
// LUT509L Configuration

#define	GFXMMU_LUT509L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT509L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT509L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT509L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT509L_EN		(0x1u<<0)

// LUT509H Configuration

#define	GFXMMU_LUT509H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT509H_LO_0		(0x1u<<4)

// LUT510L Configuration

#define	GFXMMU_LUT510L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT510L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT510L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT510L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT510L_EN		(0x1u<<0)

// LUT510H Configuration

#define	GFXMMU_LUT510H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT510H_LO_0		(0x1u<<4)

// LUT511L Configuration

#define	GFXMMU_LUT511L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT511L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT511L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT511L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT511L_EN		(0x1u<<0)

// LUT511H Configuration

#define	GFXMMU_LUT511H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT511H_LO_0		(0x1u<<4)

// LUT512L Configuration

#define	GFXMMU_LUT512L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT512L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT512L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT512L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT512L_EN		(0x1u<<0)

// LUT512H Configuration

#define	GFXMMU_LUT512H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT512H_LO_0		(0x1u<<4)

// LUT513L Configuration

#define	GFXMMU_LUT513L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT513L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT513L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT513L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT513L_EN		(0x1u<<0)

// LUT513H Configuration

#define	GFXMMU_LUT513H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT513H_LO_0		(0x1u<<4)

// LUT514L Configuration

#define	GFXMMU_LUT514L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT514L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT514L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT514L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT514L_EN		(0x1u<<0)

// LUT514H Configuration

#define	GFXMMU_LUT514H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT514H_LO_0		(0x1u<<4)

// LUT515L Configuration

#define	GFXMMU_LUT515L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT515L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT515L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT515L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT515L_EN		(0x1u<<0)

// LUT515H Configuration

#define	GFXMMU_LUT515H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT515H_LO_0		(0x1u<<4)

// LUT516L Configuration

#define	GFXMMU_LUT516L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT516L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT516L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT516L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT516L_EN		(0x1u<<0)

// LUT516H Configuration

#define	GFXMMU_LUT516H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT516H_LO_0		(0x1u<<4)

// LUT517L Configuration

#define	GFXMMU_LUT517L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT517L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT517L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT517L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT517L_EN		(0x1u<<0)

// LUT517H Configuration

#define	GFXMMU_LUT517H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT517H_LO_0		(0x1u<<4)

// LUT518L Configuration

#define	GFXMMU_LUT518L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT518L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT518L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT518L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT518L_EN		(0x1u<<0)

// LUT518H Configuration

#define	GFXMMU_LUT518H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT518H_LO_0		(0x1u<<4)

// LUT519L Configuration

#define	GFXMMU_LUT519L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT519L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT519L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT519L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT519L_EN		(0x1u<<0)

// LUT519H Configuration

#define	GFXMMU_LUT519H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT519H_LO_0		(0x1u<<4)

// LUT520L Configuration

#define	GFXMMU_LUT520L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT520L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT520L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT520L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT520L_EN		(0x1u<<0)

// LUT520H Configuration

#define	GFXMMU_LUT520H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT520H_LO_0		(0x1u<<4)

// LUT521L Configuration

#define	GFXMMU_LUT521L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT521L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT521L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT521L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT521L_EN		(0x1u<<0)

// LUT521H Configuration

#define	GFXMMU_LUT521H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT521H_LO_0		(0x1u<<4)

// LUT522L Configuration

#define	GFXMMU_LUT522L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT522L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT522L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT522L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT522L_EN		(0x1u<<0)

// LUT522H Configuration

#define	GFXMMU_LUT522H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT522H_LO_0		(0x1u<<4)

// LUT523L Configuration

#define	GFXMMU_LUT523L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT523L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT523L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT523L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT523L_EN		(0x1u<<0)

// LUT523H Configuration

#define	GFXMMU_LUT523H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT523H_LO_0		(0x1u<<4)

// LUT524L Configuration

#define	GFXMMU_LUT524L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT524L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT524L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT524L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT524L_EN		(0x1u<<0)

// LUT524H Configuration

#define	GFXMMU_LUT524H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT524H_LO_0		(0x1u<<4)

// LUT525L Configuration

#define	GFXMMU_LUT525L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT525L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT525L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT525L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT525L_EN		(0x1u<<0)

// LUT525H Configuration

#define	GFXMMU_LUT525H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT525H_LO_0		(0x1u<<4)

// LUT526L Configuration

#define	GFXMMU_LUT526L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT526L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT526L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT526L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT526L_EN		(0x1u<<0)

// LUT526H Configuration

#define	GFXMMU_LUT526H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT526H_LO_0		(0x1u<<4)

// LUT527L Configuration

#define	GFXMMU_LUT527L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT527L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT527L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT527L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT527L_EN		(0x1u<<0)

// LUT527H Configuration

#define	GFXMMU_LUT527H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT527H_LO_0		(0x1u<<4)

// LUT528L Configuration

#define	GFXMMU_LUT528L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT528L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT528L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT528L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT528L_EN		(0x1u<<0)

// LUT528H Configuration

