Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
// LUT584H Configuration

#define	GFXMMU_LUT584H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT584H_LO_0		(0x1u<<4)

// LUT585L Configuration

#define	GFXMMU_LUT585L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT585L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT585L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT585L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT585L_EN		(0x1u<<0)

// LUT585H Configuration

#define	GFXMMU_LUT585H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT585H_LO_0		(0x1u<<4)

// LUT586L Configuration

#define	GFXMMU_LUT586L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT586L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT586L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT586L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT586L_EN		(0x1u<<0)

// LUT586H Configuration

#define	GFXMMU_LUT586H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT586H_LO_0		(0x1u<<4)

// LUT587L Configuration

#define	GFXMMU_LUT587L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT587L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT587L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT587L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT587L_EN		(0x1u<<0)

// LUT587H Configuration

#define	GFXMMU_LUT587H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT587H_LO_0		(0x1u<<4)

// LUT588L Configuration

#define	GFXMMU_LUT588L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT588L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT588L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT588L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT588L_EN		(0x1u<<0)

// LUT588H Configuration

#define	GFXMMU_LUT588H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT588H_LO_0		(0x1u<<4)

// LUT589L Configuration

#define	GFXMMU_LUT589L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT589L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT589L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT589L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT589L_EN		(0x1u<<0)

// LUT589H Configuration

#define	GFXMMU_LUT589H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT589H_LO_0		(0x1u<<4)

// LUT590L Configuration

#define	GFXMMU_LUT590L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT590L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT590L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT590L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT590L_EN		(0x1u<<0)

// LUT590H Configuration

#define	GFXMMU_LUT590H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT590H_LO_0		(0x1u<<4)

// LUT591L Configuration

#define	GFXMMU_LUT591L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT591L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT591L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT591L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT591L_EN		(0x1u<<0)

// LUT591H Configuration

#define	GFXMMU_LUT591H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT591H_LO_0		(0x1u<<4)

// LUT592L Configuration

#define	GFXMMU_LUT592L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT592L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT592L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT592L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT592L_EN		(0x1u<<0)

// LUT592H Configuration

#define	GFXMMU_LUT592H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT592H_LO_0		(0x1u<<4)

// LUT593L Configuration

#define	GFXMMU_LUT593L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT593L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT593L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT593L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT593L_EN		(0x1u<<0)

// LUT593H Configuration

#define	GFXMMU_LUT593H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT593H_LO_0		(0x1u<<4)

// LUT594L Configuration

#define	GFXMMU_LUT594L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT594L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT594L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT594L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT594L_EN		(0x1u<<0)

// LUT594H Configuration

#define	GFXMMU_LUT594H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT594H_LO_0		(0x1u<<4)

// LUT595L Configuration

#define	GFXMMU_LUT595L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT595L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT595L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT595L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT595L_EN		(0x1u<<0)

// LUT595H Configuration

#define	GFXMMU_LUT595H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT595H_LO_0		(0x1u<<4)

// LUT596L Configuration

#define	GFXMMU_LUT596L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT596L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT596L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT596L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT596L_EN		(0x1u<<0)

// LUT596H Configuration

#define	GFXMMU_LUT596H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT596H_LO_0		(0x1u<<4)

// LUT597L Configuration

#define	GFXMMU_LUT597L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT597L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT597L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT597L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT597L_EN		(0x1u<<0)

// LUT597H Configuration

#define	GFXMMU_LUT597H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT597H_LO_0		(0x1u<<4)

// LUT598L Configuration

#define	GFXMMU_LUT598L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT598L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT598L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT598L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT598L_EN		(0x1u<<0)

// LUT598H Configuration

#define	GFXMMU_LUT598H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT598H_LO_0		(0x1u<<4)

// LUT599L Configuration

#define	GFXMMU_LUT599L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT599L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT599L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT599L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT599L_EN		(0x1u<<0)

// LUT599H Configuration

#define	GFXMMU_LUT599H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT599H_LO_0		(0x1u<<4)

// LUT600L Configuration

#define	GFXMMU_LUT600L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT600L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT600L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT600L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT600L_EN		(0x1u<<0)

// LUT600H Configuration

#define	GFXMMU_LUT600H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT600H_LO_0		(0x1u<<4)

// LUT601L Configuration

#define	GFXMMU_LUT601L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT601L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT601L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT601L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT601L_EN		(0x1u<<0)

// LUT601H Configuration

#define	GFXMMU_LUT601H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT601H_LO_0		(0x1u<<4)

// LUT602L Configuration

#define	GFXMMU_LUT602L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT602L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT602L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT602L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT602L_EN		(0x1u<<0)

// LUT602H Configuration

#define	GFXMMU_LUT602H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT602H_LO_0		(0x1u<<4)

// LUT603L Configuration

