Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
#define	GFXMMU_LUT621H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT621H_LO_0		(0x1u<<4)

// LUT622L Configuration

#define	GFXMMU_LUT622L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT622L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT622L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT622L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT622L_EN		(0x1u<<0)

// LUT622H Configuration

#define	GFXMMU_LUT622H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT622H_LO_0		(0x1u<<4)

// LUT623L Configuration

#define	GFXMMU_LUT623L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT623L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT623L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT623L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT623L_EN		(0x1u<<0)

// LUT623H Configuration

#define	GFXMMU_LUT623H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT623H_LO_0		(0x1u<<4)

// LUT624L Configuration

#define	GFXMMU_LUT624L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT624L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT624L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT624L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT624L_EN		(0x1u<<0)

// LUT624H Configuration

#define	GFXMMU_LUT624H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT624H_LO_0		(0x1u<<4)

// LUT625L Configuration

#define	GFXMMU_LUT625L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT625L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT625L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT625L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT625L_EN		(0x1u<<0)

// LUT625H Configuration

#define	GFXMMU_LUT625H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT625H_LO_0		(0x1u<<4)

// LUT626L Configuration

#define	GFXMMU_LUT626L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT626L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT626L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT626L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT626L_EN		(0x1u<<0)

// LUT626H Configuration

#define	GFXMMU_LUT626H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT626H_LO_0		(0x1u<<4)

// LUT627L Configuration

#define	GFXMMU_LUT627L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT627L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT627L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT627L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT627L_EN		(0x1u<<0)

// LUT627H Configuration

#define	GFXMMU_LUT627H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT627H_LO_0		(0x1u<<4)

// LUT628L Configuration

#define	GFXMMU_LUT628L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT628L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT628L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT628L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT628L_EN		(0x1u<<0)

// LUT628H Configuration

#define	GFXMMU_LUT628H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT628H_LO_0		(0x1u<<4)

// LUT629L Configuration

#define	GFXMMU_LUT629L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT629L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT629L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT629L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT629L_EN		(0x1u<<0)

// LUT629H Configuration

#define	GFXMMU_LUT629H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT629H_LO_0		(0x1u<<4)

// LUT630L Configuration

#define	GFXMMU_LUT630L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT630L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT630L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT630L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT630L_EN		(0x1u<<0)

// LUT630H Configuration

#define	GFXMMU_LUT630H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT630H_LO_0		(0x1u<<4)

// LUT631L Configuration

#define	GFXMMU_LUT631L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT631L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT631L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT631L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT631L_EN		(0x1u<<0)

// LUT631H Configuration

#define	GFXMMU_LUT631H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT631H_LO_0		(0x1u<<4)

// LUT632L Configuration

#define	GFXMMU_LUT632L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT632L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT632L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT632L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT632L_EN		(0x1u<<0)

// LUT632H Configuration

#define	GFXMMU_LUT632H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT632H_LO_0		(0x1u<<4)

// LUT633L Configuration

#define	GFXMMU_LUT633L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT633L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT633L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT633L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT633L_EN		(0x1u<<0)

// LUT633H Configuration

#define	GFXMMU_LUT633H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT633H_LO_0		(0x1u<<4)

// LUT634L Configuration

#define	GFXMMU_LUT634L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT634L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT634L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT634L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT634L_EN		(0x1u<<0)

// LUT634H Configuration

#define	GFXMMU_LUT634H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT634H_LO_0		(0x1u<<4)

// LUT635L Configuration

#define	GFXMMU_LUT635L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT635L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT635L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT635L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT635L_EN		(0x1u<<0)

// LUT635H Configuration

#define	GFXMMU_LUT635H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT635H_LO_0		(0x1u<<4)

// LUT636L Configuration

#define	GFXMMU_LUT636L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT636L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT636L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT636L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT636L_EN		(0x1u<<0)

// LUT636H Configuration

#define	GFXMMU_LUT636H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT636H_LO_0		(0x1u<<4)

// LUT637L Configuration

#define	GFXMMU_LUT637L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT637L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT637L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT637L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT637L_EN		(0x1u<<0)

// LUT637H Configuration

#define	GFXMMU_LUT637H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT637H_LO_0		(0x1u<<4)

// LUT638L Configuration

#define	GFXMMU_LUT638L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT638L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT638L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT638L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT638L_EN		(0x1u<<0)

// LUT638H Configuration

#define	GFXMMU_LUT638H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT638H_LO_0		(0x1u<<4)

// LUT639L Configuration

#define	GFXMMU_LUT639L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT639L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT639L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT639L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT639L_EN		(0x1u<<0)

// LUT639H Configuration

#define	GFXMMU_LUT639H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT639H_LO_0		(0x1u<<4)

// LUT640L Configuration

