Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
#define	GFXMMU_LUT640L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT640L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT640L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT640L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT640L_EN		(0x1u<<0)

// LUT640H Configuration

#define	GFXMMU_LUT640H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT640H_LO_0		(0x1u<<4)

// LUT641L Configuration

#define	GFXMMU_LUT641L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT641L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT641L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT641L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT641L_EN		(0x1u<<0)

// LUT641H Configuration

#define	GFXMMU_LUT641H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT641H_LO_0		(0x1u<<4)

// LUT642L Configuration

#define	GFXMMU_LUT642L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT642L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT642L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT642L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT642L_EN		(0x1u<<0)

// LUT642H Configuration

#define	GFXMMU_LUT642H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT642H_LO_0		(0x1u<<4)

// LUT643L Configuration

#define	GFXMMU_LUT643L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT643L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT643L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT643L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT643L_EN		(0x1u<<0)

// LUT643H Configuration

#define	GFXMMU_LUT643H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT643H_LO_0		(0x1u<<4)

// LUT644L Configuration

#define	GFXMMU_LUT644L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT644L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT644L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT644L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT644L_EN		(0x1u<<0)

// LUT644H Configuration

#define	GFXMMU_LUT644H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT644H_LO_0		(0x1u<<4)

// LUT645L Configuration

#define	GFXMMU_LUT645L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT645L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT645L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT645L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT645L_EN		(0x1u<<0)

// LUT645H Configuration

#define	GFXMMU_LUT645H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT645H_LO_0		(0x1u<<4)

// LUT646L Configuration

#define	GFXMMU_LUT646L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT646L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT646L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT646L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT646L_EN		(0x1u<<0)

// LUT646H Configuration

#define	GFXMMU_LUT646H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT646H_LO_0		(0x1u<<4)

// LUT647L Configuration

#define	GFXMMU_LUT647L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT647L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT647L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT647L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT647L_EN		(0x1u<<0)

// LUT647H Configuration

#define	GFXMMU_LUT647H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT647H_LO_0		(0x1u<<4)

// LUT648L Configuration

#define	GFXMMU_LUT648L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT648L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT648L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT648L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT648L_EN		(0x1u<<0)

// LUT648H Configuration

#define	GFXMMU_LUT648H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT648H_LO_0		(0x1u<<4)

// LUT649L Configuration

#define	GFXMMU_LUT649L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT649L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT649L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT649L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT649L_EN		(0x1u<<0)

// LUT649H Configuration

#define	GFXMMU_LUT649H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT649H_LO_0		(0x1u<<4)

// LUT650L Configuration

#define	GFXMMU_LUT650L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT650L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT650L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT650L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT650L_EN		(0x1u<<0)

// LUT650H Configuration

#define	GFXMMU_LUT650H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT650H_LO_0		(0x1u<<4)

// LUT651L Configuration

#define	GFXMMU_LUT651L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT651L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT651L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT651L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT651L_EN		(0x1u<<0)

// LUT651H Configuration

#define	GFXMMU_LUT651H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT651H_LO_0		(0x1u<<4)

// LUT652L Configuration

#define	GFXMMU_LUT652L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT652L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT652L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT652L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT652L_EN		(0x1u<<0)

// LUT652H Configuration

#define	GFXMMU_LUT652H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT652H_LO_0		(0x1u<<4)

// LUT653L Configuration

#define	GFXMMU_LUT653L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT653L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT653L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT653L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT653L_EN		(0x1u<<0)

// LUT653H Configuration

#define	GFXMMU_LUT653H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT653H_LO_0		(0x1u<<4)

// LUT654L Configuration

#define	GFXMMU_LUT654L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT654L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT654L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT654L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT654L_EN		(0x1u<<0)

// LUT654H Configuration

#define	GFXMMU_LUT654H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT654H_LO_0		(0x1u<<4)

// LUT655L Configuration

#define	GFXMMU_LUT655L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT655L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT655L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT655L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT655L_EN		(0x1u<<0)

// LUT655H Configuration

#define	GFXMMU_LUT655H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT655H_LO_0		(0x1u<<4)

// LUT656L Configuration

#define	GFXMMU_LUT656L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT656L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT656L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT656L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT656L_EN		(0x1u<<0)

// LUT656H Configuration

#define	GFXMMU_LUT656H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT656H_LO_0		(0x1u<<4)

// LUT657L Configuration

#define	GFXMMU_LUT657L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT657L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT657L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT657L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT657L_EN		(0x1u<<0)

// LUT657H Configuration

#define	GFXMMU_LUT657H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT657H_LO_0		(0x1u<<4)

// LUT658L Configuration

#define	GFXMMU_LUT658L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT658L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT658L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT658L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT658L_EN		(0x1u<<0)

