Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
// LUT697L Configuration

#define	GFXMMU_LUT697L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT697L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT697L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT697L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT697L_EN		(0x1u<<0)

// LUT697H Configuration

#define	GFXMMU_LUT697H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT697H_LO_0		(0x1u<<4)

// LUT698L Configuration

#define	GFXMMU_LUT698L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT698L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT698L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT698L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT698L_EN		(0x1u<<0)

// LUT698H Configuration

#define	GFXMMU_LUT698H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT698H_LO_0		(0x1u<<4)

// LUT699L Configuration

#define	GFXMMU_LUT699L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT699L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT699L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT699L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT699L_EN		(0x1u<<0)

// LUT699H Configuration

#define	GFXMMU_LUT699H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT699H_LO_0		(0x1u<<4)

// LUT700L Configuration

#define	GFXMMU_LUT700L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT700L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT700L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT700L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT700L_EN		(0x1u<<0)

// LUT700H Configuration

#define	GFXMMU_LUT700H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT700H_LO_0		(0x1u<<4)

// LUT701L Configuration

#define	GFXMMU_LUT701L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT701L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT701L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT701L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT701L_EN		(0x1u<<0)

// LUT701H Configuration

#define	GFXMMU_LUT701H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT701H_LO_0		(0x1u<<4)

// LUT702L Configuration

#define	GFXMMU_LUT702L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT702L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT702L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT702L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT702L_EN		(0x1u<<0)

// LUT702H Configuration

#define	GFXMMU_LUT702H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT702H_LO_0		(0x1u<<4)

// LUT703L Configuration

#define	GFXMMU_LUT703L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT703L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT703L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT703L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT703L_EN		(0x1u<<0)

// LUT703H Configuration

#define	GFXMMU_LUT703H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT703H_LO_0		(0x1u<<4)

// LUT704L Configuration

#define	GFXMMU_LUT704L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT704L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT704L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT704L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT704L_EN		(0x1u<<0)

// LUT704H Configuration

#define	GFXMMU_LUT704H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT704H_LO_0		(0x1u<<4)

// LUT705L Configuration

#define	GFXMMU_LUT705L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT705L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT705L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT705L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT705L_EN		(0x1u<<0)

// LUT705H Configuration

#define	GFXMMU_LUT705H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT705H_LO_0		(0x1u<<4)

// LUT706L Configuration

#define	GFXMMU_LUT706L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT706L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT706L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT706L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT706L_EN		(0x1u<<0)

// LUT706H Configuration

#define	GFXMMU_LUT706H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT706H_LO_0		(0x1u<<4)

// LUT707L Configuration

#define	GFXMMU_LUT707L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT707L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT707L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT707L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT707L_EN		(0x1u<<0)

// LUT707H Configuration

#define	GFXMMU_LUT707H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT707H_LO_0		(0x1u<<4)

// LUT708L Configuration

#define	GFXMMU_LUT708L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT708L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT708L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT708L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT708L_EN		(0x1u<<0)

// LUT708H Configuration

#define	GFXMMU_LUT708H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT708H_LO_0		(0x1u<<4)

// LUT709L Configuration

#define	GFXMMU_LUT709L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT709L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT709L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT709L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT709L_EN		(0x1u<<0)

// LUT709H Configuration

#define	GFXMMU_LUT709H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT709H_LO_0		(0x1u<<4)

// LUT710L Configuration

#define	GFXMMU_LUT710L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT710L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT710L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT710L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT710L_EN		(0x1u<<0)

// LUT710H Configuration

#define	GFXMMU_LUT710H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT710H_LO_0		(0x1u<<4)

// LUT711L Configuration

#define	GFXMMU_LUT711L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT711L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT711L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT711L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT711L_EN		(0x1u<<0)

// LUT711H Configuration

#define	GFXMMU_LUT711H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT711H_LO_0		(0x1u<<4)

// LUT712L Configuration

#define	GFXMMU_LUT712L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT712L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT712L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT712L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT712L_EN		(0x1u<<0)

// LUT712H Configuration

#define	GFXMMU_LUT712H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT712H_LO_0		(0x1u<<4)

// LUT713L Configuration

#define	GFXMMU_LUT713L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT713L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT713L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT713L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT713L_EN		(0x1u<<0)

// LUT713H Configuration

#define	GFXMMU_LUT713H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT713H_LO_0		(0x1u<<4)

// LUT714L Configuration

#define	GFXMMU_LUT714L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT714L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT714L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT714L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT714L_EN		(0x1u<<0)

// LUT714H Configuration

#define	GFXMMU_LUT714H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT714H_LO_0		(0x1u<<4)

// LUT715L Configuration

#define	GFXMMU_LUT715L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT715L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT715L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT715L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT715L_EN		(0x1u<<0)

// LUT715H Configuration

#define	GFXMMU_LUT715H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT715H_LO_0		(0x1u<<4)

// LUT716L Configuration

#define	GFXMMU_LUT716L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT716L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT716L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT716L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT716L_EN		(0x1u<<0)

// LUT716H Configuration

