Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
// LUT735H Configuration

#define	GFXMMU_LUT735H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT735H_LO_0		(0x1u<<4)

// LUT736L Configuration

#define	GFXMMU_LUT736L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT736L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT736L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT736L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT736L_EN		(0x1u<<0)

// LUT736H Configuration

#define	GFXMMU_LUT736H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT736H_LO_0		(0x1u<<4)

// LUT737L Configuration

#define	GFXMMU_LUT737L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT737L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT737L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT737L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT737L_EN		(0x1u<<0)

// LUT737H Configuration

#define	GFXMMU_LUT737H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT737H_LO_0		(0x1u<<4)

// LUT738L Configuration

#define	GFXMMU_LUT738L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT738L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT738L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT738L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT738L_EN		(0x1u<<0)

// LUT738H Configuration

#define	GFXMMU_LUT738H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT738H_LO_0		(0x1u<<4)

// LUT739L Configuration

#define	GFXMMU_LUT739L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT739L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT739L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT739L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT739L_EN		(0x1u<<0)

// LUT739H Configuration

#define	GFXMMU_LUT739H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT739H_LO_0		(0x1u<<4)

// LUT740L Configuration

#define	GFXMMU_LUT740L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT740L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT740L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT740L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT740L_EN		(0x1u<<0)

// LUT740H Configuration

#define	GFXMMU_LUT740H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT740H_LO_0		(0x1u<<4)

// LUT741L Configuration

#define	GFXMMU_LUT741L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT741L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT741L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT741L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT741L_EN		(0x1u<<0)

// LUT741H Configuration

#define	GFXMMU_LUT741H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT741H_LO_0		(0x1u<<4)

// LUT742L Configuration

#define	GFXMMU_LUT742L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT742L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT742L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT742L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT742L_EN		(0x1u<<0)

// LUT742H Configuration

#define	GFXMMU_LUT742H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT742H_LO_0		(0x1u<<4)

// LUT743L Configuration

#define	GFXMMU_LUT743L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT743L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT743L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT743L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT743L_EN		(0x1u<<0)

// LUT743H Configuration

#define	GFXMMU_LUT743H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT743H_LO_0		(0x1u<<4)

// LUT744L Configuration

#define	GFXMMU_LUT744L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT744L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT744L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT744L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT744L_EN		(0x1u<<0)

// LUT744H Configuration

#define	GFXMMU_LUT744H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT744H_LO_0		(0x1u<<4)

// LUT745L Configuration

#define	GFXMMU_LUT745L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT745L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT745L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT745L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT745L_EN		(0x1u<<0)

// LUT745H Configuration

#define	GFXMMU_LUT745H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT745H_LO_0		(0x1u<<4)

// LUT746L Configuration

#define	GFXMMU_LUT746L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT746L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT746L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT746L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT746L_EN		(0x1u<<0)

// LUT746H Configuration

#define	GFXMMU_LUT746H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT746H_LO_0		(0x1u<<4)

// LUT747L Configuration

#define	GFXMMU_LUT747L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT747L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT747L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT747L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT747L_EN		(0x1u<<0)

// LUT747H Configuration

#define	GFXMMU_LUT747H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT747H_LO_0		(0x1u<<4)

// LUT748L Configuration

#define	GFXMMU_LUT748L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT748L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT748L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT748L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT748L_EN		(0x1u<<0)

// LUT748H Configuration

#define	GFXMMU_LUT748H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT748H_LO_0		(0x1u<<4)

// LUT749L Configuration

#define	GFXMMU_LUT749L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT749L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT749L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT749L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT749L_EN		(0x1u<<0)

// LUT749H Configuration

#define	GFXMMU_LUT749H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT749H_LO_0		(0x1u<<4)

// LUT750L Configuration

#define	GFXMMU_LUT750L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT750L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT750L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT750L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT750L_EN		(0x1u<<0)

// LUT750H Configuration

#define	GFXMMU_LUT750H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT750H_LO_0		(0x1u<<4)

// LUT751L Configuration

#define	GFXMMU_LUT751L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT751L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT751L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT751L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT751L_EN		(0x1u<<0)

// LUT751H Configuration

#define	GFXMMU_LUT751H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT751H_LO_0		(0x1u<<4)

// LUT752L Configuration

#define	GFXMMU_LUT752L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT752L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT752L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT752L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT752L_EN		(0x1u<<0)

// LUT752H Configuration

#define	GFXMMU_LUT752H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT752H_LO_0		(0x1u<<4)

// LUT753L Configuration

#define	GFXMMU_LUT753L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT753L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT753L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT753L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT753L_EN		(0x1u<<0)

// LUT753H Configuration

#define	GFXMMU_LUT753H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT753H_LO_0		(0x1u<<4)

// LUT754L Configuration

#define	GFXMMU_LUT754L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT754L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT754L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT754L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT754L_EN		(0x1u<<0)

// LUT754H Configuration

#define	GFXMMU_LUT754H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT754H_LO_0		(0x1u<<4)

// LUT755L Configuration

#define	GFXMMU_LUT755L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT755L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT755L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT755L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT755L_EN		(0x1u<<0)

