Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
// LUT755H Configuration

#define	GFXMMU_LUT755H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT755H_LO_0		(0x1u<<4)

// LUT756L Configuration

#define	GFXMMU_LUT756L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT756L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT756L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT756L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT756L_EN		(0x1u<<0)

// LUT756H Configuration

#define	GFXMMU_LUT756H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT756H_LO_0		(0x1u<<4)

// LUT757L Configuration

#define	GFXMMU_LUT757L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT757L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT757L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT757L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT757L_EN		(0x1u<<0)

// LUT757H Configuration

#define	GFXMMU_LUT757H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT757H_LO_0		(0x1u<<4)

// LUT758L Configuration

#define	GFXMMU_LUT758L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT758L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT758L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT758L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT758L_EN		(0x1u<<0)

// LUT758H Configuration

#define	GFXMMU_LUT758H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT758H_LO_0		(0x1u<<4)

// LUT759L Configuration

#define	GFXMMU_LUT759L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT759L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT759L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT759L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT759L_EN		(0x1u<<0)

// LUT759H Configuration

#define	GFXMMU_LUT759H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT759H_LO_0		(0x1u<<4)

// LUT760L Configuration

#define	GFXMMU_LUT760L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT760L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT760L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT760L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT760L_EN		(0x1u<<0)

// LUT760H Configuration

#define	GFXMMU_LUT760H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT760H_LO_0		(0x1u<<4)

// LUT761L Configuration

#define	GFXMMU_LUT761L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT761L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT761L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT761L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT761L_EN		(0x1u<<0)

// LUT761H Configuration

#define	GFXMMU_LUT761H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT761H_LO_0		(0x1u<<4)

// LUT762L Configuration

#define	GFXMMU_LUT762L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT762L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT762L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT762L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT762L_EN		(0x1u<<0)

// LUT762H Configuration

#define	GFXMMU_LUT762H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT762H_LO_0		(0x1u<<4)

// LUT763L Configuration

#define	GFXMMU_LUT763L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT763L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT763L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT763L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT763L_EN		(0x1u<<0)

// LUT763H Configuration

#define	GFXMMU_LUT763H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT763H_LO_0		(0x1u<<4)

// LUT764L Configuration

#define	GFXMMU_LUT764L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT764L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT764L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT764L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT764L_EN		(0x1u<<0)

// LUT764H Configuration

#define	GFXMMU_LUT764H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT764H_LO_0		(0x1u<<4)

// LUT765L Configuration

#define	GFXMMU_LUT765L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT765L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT765L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT765L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT765L_EN		(0x1u<<0)

// LUT765H Configuration

#define	GFXMMU_LUT765H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT765H_LO_0		(0x1u<<4)

// LUT766L Configuration

#define	GFXMMU_LUT766L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT766L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT766L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT766L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT766L_EN		(0x1u<<0)

// LUT766H Configuration

#define	GFXMMU_LUT766H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT766H_LO_0		(0x1u<<4)

// LUT767L Configuration

#define	GFXMMU_LUT767L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT767L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT767L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT767L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT767L_EN		(0x1u<<0)

// LUT767H Configuration

#define	GFXMMU_LUT767H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT767H_LO_0		(0x1u<<4)

// LUT768L Configuration

#define	GFXMMU_LUT768L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT768L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT768L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT768L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT768L_EN		(0x1u<<0)

// LUT768H Configuration

#define	GFXMMU_LUT768H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT768H_LO_0		(0x1u<<4)

// LUT769L Configuration

#define	GFXMMU_LUT769L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT769L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT769L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT769L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT769L_EN		(0x1u<<0)

// LUT769H Configuration

#define	GFXMMU_LUT769H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT769H_LO_0		(0x1u<<4)

// LUT770L Configuration

#define	GFXMMU_LUT770L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT770L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT770L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT770L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT770L_EN		(0x1u<<0)

// LUT770H Configuration

#define	GFXMMU_LUT770H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT770H_LO_0		(0x1u<<4)

// LUT771L Configuration

#define	GFXMMU_LUT771L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT771L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT771L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT771L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT771L_EN		(0x1u<<0)

// LUT771H Configuration

#define	GFXMMU_LUT771H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT771H_LO_0		(0x1u<<4)

// LUT772L Configuration

#define	GFXMMU_LUT772L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT772L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT772L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT772L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT772L_EN		(0x1u<<0)

// LUT772H Configuration

#define	GFXMMU_LUT772H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT772H_LO_0		(0x1u<<4)

// LUT773L Configuration

#define	GFXMMU_LUT773L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT773L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT773L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT773L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT773L_EN		(0x1u<<0)

// LUT773H Configuration

#define	GFXMMU_LUT773H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT773H_LO_0		(0x1u<<4)

// LUT774L Configuration

#define	GFXMMU_LUT774L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT774L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT774L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT774L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT774L_EN		(0x1u<<0)

// LUT774H Configuration

#define	GFXMMU_LUT774H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT774H_LO_0		(0x1u<<4)

