Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
// LUT775L Configuration

#define	GFXMMU_LUT775L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT775L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT775L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT775L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT775L_EN		(0x1u<<0)

// LUT775H Configuration

#define	GFXMMU_LUT775H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT775H_LO_0		(0x1u<<4)

// LUT776L Configuration

#define	GFXMMU_LUT776L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT776L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT776L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT776L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT776L_EN		(0x1u<<0)

// LUT776H Configuration

#define	GFXMMU_LUT776H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT776H_LO_0		(0x1u<<4)

// LUT777L Configuration

#define	GFXMMU_LUT777L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT777L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT777L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT777L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT777L_EN		(0x1u<<0)

// LUT777H Configuration

#define	GFXMMU_LUT777H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT777H_LO_0		(0x1u<<4)

// LUT778L Configuration

#define	GFXMMU_LUT778L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT778L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT778L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT778L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT778L_EN		(0x1u<<0)

// LUT778H Configuration

#define	GFXMMU_LUT778H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT778H_LO_0		(0x1u<<4)

// LUT779L Configuration

#define	GFXMMU_LUT779L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT779L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT779L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT779L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT779L_EN		(0x1u<<0)

// LUT779H Configuration

#define	GFXMMU_LUT779H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT779H_LO_0		(0x1u<<4)

// LUT780L Configuration

#define	GFXMMU_LUT780L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT780L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT780L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT780L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT780L_EN		(0x1u<<0)

// LUT780H Configuration

#define	GFXMMU_LUT780H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT780H_LO_0		(0x1u<<4)

// LUT781L Configuration

#define	GFXMMU_LUT781L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT781L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT781L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT781L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT781L_EN		(0x1u<<0)

// LUT781H Configuration

#define	GFXMMU_LUT781H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT781H_LO_0		(0x1u<<4)

// LUT782L Configuration

#define	GFXMMU_LUT782L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT782L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT782L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT782L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT782L_EN		(0x1u<<0)

// LUT782H Configuration

#define	GFXMMU_LUT782H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT782H_LO_0		(0x1u<<4)

// LUT783L Configuration

#define	GFXMMU_LUT783L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT783L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT783L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT783L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT783L_EN		(0x1u<<0)

// LUT783H Configuration

#define	GFXMMU_LUT783H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT783H_LO_0		(0x1u<<4)

// LUT784L Configuration

#define	GFXMMU_LUT784L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT784L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT784L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT784L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT784L_EN		(0x1u<<0)

// LUT784H Configuration

#define	GFXMMU_LUT784H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT784H_LO_0		(0x1u<<4)

// LUT785L Configuration

#define	GFXMMU_LUT785L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT785L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT785L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT785L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT785L_EN		(0x1u<<0)

// LUT785H Configuration

#define	GFXMMU_LUT785H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT785H_LO_0		(0x1u<<4)

// LUT786L Configuration

#define	GFXMMU_LUT786L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT786L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT786L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT786L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT786L_EN		(0x1u<<0)

// LUT786H Configuration

#define	GFXMMU_LUT786H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT786H_LO_0		(0x1u<<4)

// LUT787L Configuration

#define	GFXMMU_LUT787L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT787L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT787L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT787L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT787L_EN		(0x1u<<0)

// LUT787H Configuration

#define	GFXMMU_LUT787H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT787H_LO_0		(0x1u<<4)

// LUT788L Configuration

#define	GFXMMU_LUT788L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT788L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT788L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT788L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT788L_EN		(0x1u<<0)

// LUT788H Configuration

#define	GFXMMU_LUT788H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT788H_LO_0		(0x1u<<4)

// LUT789L Configuration

#define	GFXMMU_LUT789L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT789L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT789L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT789L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT789L_EN		(0x1u<<0)

// LUT789H Configuration

#define	GFXMMU_LUT789H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT789H_LO_0		(0x1u<<4)

// LUT790L Configuration

#define	GFXMMU_LUT790L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT790L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT790L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT790L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT790L_EN		(0x1u<<0)

// LUT790H Configuration

#define	GFXMMU_LUT790H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT790H_LO_0		(0x1u<<4)

// LUT791L Configuration

#define	GFXMMU_LUT791L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT791L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT791L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT791L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT791L_EN		(0x1u<<0)

// LUT791H Configuration

#define	GFXMMU_LUT791H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT791H_LO_0		(0x1u<<4)

// LUT792L Configuration

#define	GFXMMU_LUT792L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT792L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT792L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT792L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT792L_EN		(0x1u<<0)

// LUT792H Configuration

#define	GFXMMU_LUT792H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT792H_LO_0		(0x1u<<4)

// LUT793L Configuration

#define	GFXMMU_LUT793L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT793L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT793L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT793L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT793L_EN		(0x1u<<0)

// LUT793H Configuration

#define	GFXMMU_LUT793H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT793H_LO_0		(0x1u<<4)

// LUT794L Configuration

#define	GFXMMU_LUT794L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT794L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT794L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT794L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT794L_EN		(0x1u<<0)

