Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
// LUT813L Configuration

#define	GFXMMU_LUT813L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT813L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT813L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT813L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT813L_EN		(0x1u<<0)

// LUT813H Configuration

#define	GFXMMU_LUT813H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT813H_LO_0		(0x1u<<4)

// LUT814L Configuration

#define	GFXMMU_LUT814L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT814L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT814L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT814L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT814L_EN		(0x1u<<0)

// LUT814H Configuration

#define	GFXMMU_LUT814H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT814H_LO_0		(0x1u<<4)

// LUT815L Configuration

#define	GFXMMU_LUT815L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT815L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT815L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT815L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT815L_EN		(0x1u<<0)

// LUT815H Configuration

#define	GFXMMU_LUT815H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT815H_LO_0		(0x1u<<4)

// LUT816L Configuration

#define	GFXMMU_LUT816L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT816L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT816L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT816L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT816L_EN		(0x1u<<0)

// LUT816H Configuration

#define	GFXMMU_LUT816H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT816H_LO_0		(0x1u<<4)

// LUT817L Configuration

#define	GFXMMU_LUT817L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT817L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT817L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT817L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT817L_EN		(0x1u<<0)

// LUT817H Configuration

#define	GFXMMU_LUT817H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT817H_LO_0		(0x1u<<4)

// LUT818L Configuration

#define	GFXMMU_LUT818L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT818L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT818L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT818L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT818L_EN		(0x1u<<0)

// LUT818H Configuration

#define	GFXMMU_LUT818H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT818H_LO_0		(0x1u<<4)

// LUT819L Configuration

#define	GFXMMU_LUT819L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT819L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT819L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT819L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT819L_EN		(0x1u<<0)

// LUT819H Configuration

#define	GFXMMU_LUT819H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT819H_LO_0		(0x1u<<4)

// LUT820L Configuration

#define	GFXMMU_LUT820L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT820L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT820L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT820L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT820L_EN		(0x1u<<0)

// LUT820H Configuration

#define	GFXMMU_LUT820H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT820H_LO_0		(0x1u<<4)

// LUT821L Configuration

#define	GFXMMU_LUT821L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT821L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT821L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT821L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT821L_EN		(0x1u<<0)

// LUT821H Configuration

#define	GFXMMU_LUT821H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT821H_LO_0		(0x1u<<4)

// LUT822L Configuration

#define	GFXMMU_LUT822L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT822L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT822L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT822L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT822L_EN		(0x1u<<0)

// LUT822H Configuration

#define	GFXMMU_LUT822H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT822H_LO_0		(0x1u<<4)

// LUT823L Configuration

#define	GFXMMU_LUT823L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT823L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT823L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT823L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT823L_EN		(0x1u<<0)

// LUT823H Configuration

#define	GFXMMU_LUT823H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT823H_LO_0		(0x1u<<4)

// LUT824L Configuration

#define	GFXMMU_LUT824L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT824L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT824L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT824L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT824L_EN		(0x1u<<0)

// LUT824H Configuration

#define	GFXMMU_LUT824H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT824H_LO_0		(0x1u<<4)

// LUT825L Configuration

#define	GFXMMU_LUT825L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT825L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT825L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT825L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT825L_EN		(0x1u<<0)

// LUT825H Configuration

#define	GFXMMU_LUT825H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT825H_LO_0		(0x1u<<4)

// LUT826L Configuration

#define	GFXMMU_LUT826L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT826L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT826L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT826L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT826L_EN		(0x1u<<0)

// LUT826H Configuration

#define	GFXMMU_LUT826H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT826H_LO_0		(0x1u<<4)

// LUT827L Configuration

#define	GFXMMU_LUT827L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT827L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT827L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT827L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT827L_EN		(0x1u<<0)

// LUT827H Configuration

#define	GFXMMU_LUT827H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT827H_LO_0		(0x1u<<4)

// LUT828L Configuration

#define	GFXMMU_LUT828L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT828L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT828L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT828L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT828L_EN		(0x1u<<0)

// LUT828H Configuration

#define	GFXMMU_LUT828H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT828H_LO_0		(0x1u<<4)

// LUT829L Configuration

#define	GFXMMU_LUT829L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT829L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT829L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT829L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT829L_EN		(0x1u<<0)

// LUT829H Configuration

#define	GFXMMU_LUT829H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT829H_LO_0		(0x1u<<4)

// LUT830L Configuration

#define	GFXMMU_LUT830L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT830L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT830L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT830L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT830L_EN		(0x1u<<0)

// LUT830H Configuration

#define	GFXMMU_LUT830H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT830H_LO_0		(0x1u<<4)

// LUT831L Configuration

#define	GFXMMU_LUT831L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT831L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT831L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT831L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT831L_EN		(0x1u<<0)

// LUT831H Configuration

#define	GFXMMU_LUT831H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT831H_LO_0		(0x1u<<4)

// LUT832L Configuration

#define	GFXMMU_LUT832L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT832L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT832L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT832L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT832L_EN		(0x1u<<0)

// LUT832H Configuration

