Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
#define	GFXMMU_LUT832H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT832H_LO_0		(0x1u<<4)

// LUT833L Configuration

#define	GFXMMU_LUT833L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT833L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT833L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT833L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT833L_EN		(0x1u<<0)

// LUT833H Configuration

#define	GFXMMU_LUT833H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT833H_LO_0		(0x1u<<4)

// LUT834L Configuration

#define	GFXMMU_LUT834L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT834L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT834L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT834L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT834L_EN		(0x1u<<0)

// LUT834H Configuration

#define	GFXMMU_LUT834H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT834H_LO_0		(0x1u<<4)

// LUT835L Configuration

#define	GFXMMU_LUT835L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT835L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT835L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT835L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT835L_EN		(0x1u<<0)

// LUT835H Configuration

#define	GFXMMU_LUT835H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT835H_LO_0		(0x1u<<4)

// LUT836L Configuration

#define	GFXMMU_LUT836L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT836L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT836L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT836L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT836L_EN		(0x1u<<0)

// LUT836H Configuration

#define	GFXMMU_LUT836H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT836H_LO_0		(0x1u<<4)

// LUT837L Configuration

#define	GFXMMU_LUT837L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT837L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT837L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT837L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT837L_EN		(0x1u<<0)

// LUT837H Configuration

#define	GFXMMU_LUT837H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT837H_LO_0		(0x1u<<4)

// LUT838L Configuration

#define	GFXMMU_LUT838L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT838L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT838L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT838L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT838L_EN		(0x1u<<0)

// LUT838H Configuration

#define	GFXMMU_LUT838H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT838H_LO_0		(0x1u<<4)

// LUT839L Configuration

#define	GFXMMU_LUT839L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT839L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT839L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT839L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT839L_EN		(0x1u<<0)

// LUT839H Configuration

#define	GFXMMU_LUT839H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT839H_LO_0		(0x1u<<4)

// LUT840L Configuration

#define	GFXMMU_LUT840L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT840L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT840L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT840L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT840L_EN		(0x1u<<0)

// LUT840H Configuration

#define	GFXMMU_LUT840H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT840H_LO_0		(0x1u<<4)

// LUT841L Configuration

#define	GFXMMU_LUT841L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT841L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT841L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT841L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT841L_EN		(0x1u<<0)

// LUT841H Configuration

#define	GFXMMU_LUT841H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT841H_LO_0		(0x1u<<4)

// LUT842L Configuration

#define	GFXMMU_LUT842L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT842L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT842L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT842L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT842L_EN		(0x1u<<0)

// LUT842H Configuration

#define	GFXMMU_LUT842H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT842H_LO_0		(0x1u<<4)

// LUT843L Configuration

#define	GFXMMU_LUT843L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT843L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT843L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT843L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT843L_EN		(0x1u<<0)

// LUT843H Configuration

#define	GFXMMU_LUT843H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT843H_LO_0		(0x1u<<4)

// LUT844L Configuration

#define	GFXMMU_LUT844L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT844L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT844L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT844L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT844L_EN		(0x1u<<0)

// LUT844H Configuration

#define	GFXMMU_LUT844H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT844H_LO_0		(0x1u<<4)

// LUT845L Configuration

#define	GFXMMU_LUT845L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT845L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT845L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT845L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT845L_EN		(0x1u<<0)

// LUT845H Configuration

#define	GFXMMU_LUT845H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT845H_LO_0		(0x1u<<4)

// LUT846L Configuration

#define	GFXMMU_LUT846L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT846L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT846L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT846L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT846L_EN		(0x1u<<0)

// LUT846H Configuration

#define	GFXMMU_LUT846H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT846H_LO_0		(0x1u<<4)

// LUT847L Configuration

#define	GFXMMU_LUT847L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT847L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT847L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT847L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT847L_EN		(0x1u<<0)

// LUT847H Configuration

#define	GFXMMU_LUT847H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT847H_LO_0		(0x1u<<4)

// LUT848L Configuration

#define	GFXMMU_LUT848L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT848L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT848L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT848L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT848L_EN		(0x1u<<0)

// LUT848H Configuration

#define	GFXMMU_LUT848H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT848H_LO_0		(0x1u<<4)

// LUT849L Configuration

#define	GFXMMU_LUT849L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT849L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT849L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT849L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT849L_EN		(0x1u<<0)

// LUT849H Configuration

#define	GFXMMU_LUT849H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT849H_LO_0		(0x1u<<4)

// LUT850L Configuration

#define	GFXMMU_LUT850L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT850L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT850L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT850L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT850L_EN		(0x1u<<0)

// LUT850H Configuration

#define	GFXMMU_LUT850H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT850H_LO_0		(0x1u<<4)

