Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
// LUT851L Configuration

#define	GFXMMU_LUT851L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT851L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT851L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT851L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT851L_EN		(0x1u<<0)

// LUT851H Configuration

#define	GFXMMU_LUT851H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT851H_LO_0		(0x1u<<4)

// LUT852L Configuration

#define	GFXMMU_LUT852L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT852L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT852L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT852L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT852L_EN		(0x1u<<0)

// LUT852H Configuration

#define	GFXMMU_LUT852H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT852H_LO_0		(0x1u<<4)

// LUT853L Configuration

#define	GFXMMU_LUT853L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT853L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT853L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT853L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT853L_EN		(0x1u<<0)

// LUT853H Configuration

#define	GFXMMU_LUT853H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT853H_LO_0		(0x1u<<4)

// LUT854L Configuration

#define	GFXMMU_LUT854L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT854L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT854L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT854L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT854L_EN		(0x1u<<0)

// LUT854H Configuration

#define	GFXMMU_LUT854H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT854H_LO_0		(0x1u<<4)

// LUT855L Configuration

#define	GFXMMU_LUT855L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT855L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT855L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT855L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT855L_EN		(0x1u<<0)

// LUT855H Configuration

#define	GFXMMU_LUT855H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT855H_LO_0		(0x1u<<4)

// LUT856L Configuration

#define	GFXMMU_LUT856L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT856L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT856L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT856L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT856L_EN		(0x1u<<0)

// LUT856H Configuration

#define	GFXMMU_LUT856H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT856H_LO_0		(0x1u<<4)

// LUT857L Configuration

#define	GFXMMU_LUT857L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT857L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT857L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT857L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT857L_EN		(0x1u<<0)

// LUT857H Configuration

#define	GFXMMU_LUT857H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT857H_LO_0		(0x1u<<4)

// LUT858L Configuration

#define	GFXMMU_LUT858L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT858L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT858L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT858L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT858L_EN		(0x1u<<0)

// LUT858H Configuration

#define	GFXMMU_LUT858H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT858H_LO_0		(0x1u<<4)

// LUT859L Configuration

#define	GFXMMU_LUT859L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT859L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT859L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT859L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT859L_EN		(0x1u<<0)

// LUT859H Configuration

#define	GFXMMU_LUT859H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT859H_LO_0		(0x1u<<4)

// LUT860L Configuration

#define	GFXMMU_LUT860L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT860L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT860L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT860L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT860L_EN		(0x1u<<0)

// LUT860H Configuration

#define	GFXMMU_LUT860H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT860H_LO_0		(0x1u<<4)

// LUT861L Configuration

#define	GFXMMU_LUT861L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT861L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT861L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT861L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT861L_EN		(0x1u<<0)

// LUT861H Configuration

#define	GFXMMU_LUT861H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT861H_LO_0		(0x1u<<4)

// LUT862L Configuration

#define	GFXMMU_LUT862L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT862L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT862L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT862L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT862L_EN		(0x1u<<0)

// LUT862H Configuration

#define	GFXMMU_LUT862H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT862H_LO_0		(0x1u<<4)

// LUT863L Configuration

#define	GFXMMU_LUT863L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT863L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT863L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT863L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT863L_EN		(0x1u<<0)

// LUT863H Configuration

#define	GFXMMU_LUT863H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT863H_LO_0		(0x1u<<4)

// LUT864L Configuration

#define	GFXMMU_LUT864L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT864L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT864L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT864L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT864L_EN		(0x1u<<0)

// LUT864H Configuration

#define	GFXMMU_LUT864H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT864H_LO_0		(0x1u<<4)

// LUT865L Configuration

#define	GFXMMU_LUT865L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT865L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT865L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT865L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT865L_EN		(0x1u<<0)

// LUT865H Configuration

#define	GFXMMU_LUT865H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT865H_LO_0		(0x1u<<4)

// LUT866L Configuration

#define	GFXMMU_LUT866L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT866L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT866L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT866L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT866L_EN		(0x1u<<0)

// LUT866H Configuration

#define	GFXMMU_LUT866H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT866H_LO_0		(0x1u<<4)

// LUT867L Configuration

#define	GFXMMU_LUT867L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT867L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT867L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT867L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT867L_EN		(0x1u<<0)

// LUT867H Configuration

#define	GFXMMU_LUT867H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT867H_LO_0		(0x1u<<4)

// LUT868L Configuration

#define	GFXMMU_LUT868L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT868L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT868L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT868L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT868L_EN		(0x1u<<0)

// LUT868H Configuration

#define	GFXMMU_LUT868H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT868H_LO_0		(0x1u<<4)

// LUT869L Configuration

#define	GFXMMU_LUT869L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT869L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT869L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT869L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT869L_EN		(0x1u<<0)

