Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
// LUT888L Configuration

#define	GFXMMU_LUT888L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT888L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT888L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT888L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT888L_EN		(0x1u<<0)

// LUT888H Configuration

#define	GFXMMU_LUT888H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT888H_LO_0		(0x1u<<4)

// LUT889L Configuration

#define	GFXMMU_LUT889L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT889L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT889L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT889L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT889L_EN		(0x1u<<0)

// LUT889H Configuration

#define	GFXMMU_LUT889H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT889H_LO_0		(0x1u<<4)

// LUT890L Configuration

#define	GFXMMU_LUT890L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT890L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT890L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT890L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT890L_EN		(0x1u<<0)

// LUT890H Configuration

#define	GFXMMU_LUT890H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT890H_LO_0		(0x1u<<4)

// LUT891L Configuration

#define	GFXMMU_LUT891L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT891L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT891L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT891L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT891L_EN		(0x1u<<0)

// LUT891H Configuration

#define	GFXMMU_LUT891H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT891H_LO_0		(0x1u<<4)

// LUT892L Configuration

#define	GFXMMU_LUT892L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT892L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT892L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT892L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT892L_EN		(0x1u<<0)

// LUT892H Configuration

#define	GFXMMU_LUT892H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT892H_LO_0		(0x1u<<4)

// LUT893L Configuration

#define	GFXMMU_LUT893L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT893L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT893L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT893L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT893L_EN		(0x1u<<0)

// LUT893H Configuration

#define	GFXMMU_LUT893H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT893H_LO_0		(0x1u<<4)

// LUT894L Configuration

#define	GFXMMU_LUT894L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT894L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT894L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT894L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT894L_EN		(0x1u<<0)

// LUT894H Configuration

#define	GFXMMU_LUT894H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT894H_LO_0		(0x1u<<4)

// LUT895L Configuration

#define	GFXMMU_LUT895L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT895L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT895L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT895L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT895L_EN		(0x1u<<0)

// LUT895H Configuration

#define	GFXMMU_LUT895H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT895H_LO_0		(0x1u<<4)

// LUT896L Configuration

#define	GFXMMU_LUT896L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT896L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT896L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT896L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT896L_EN		(0x1u<<0)

// LUT896H Configuration

#define	GFXMMU_LUT896H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT896H_LO_0		(0x1u<<4)

// LUT897L Configuration

#define	GFXMMU_LUT897L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT897L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT897L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT897L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT897L_EN		(0x1u<<0)

// LUT897H Configuration

#define	GFXMMU_LUT897H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT897H_LO_0		(0x1u<<4)

// LUT898L Configuration

#define	GFXMMU_LUT898L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT898L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT898L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT898L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT898L_EN		(0x1u<<0)

// LUT898H Configuration

#define	GFXMMU_LUT898H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT898H_LO_0		(0x1u<<4)

// LUT899L Configuration

#define	GFXMMU_LUT899L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT899L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT899L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT899L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT899L_EN		(0x1u<<0)

// LUT899H Configuration

#define	GFXMMU_LUT899H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT899H_LO_0		(0x1u<<4)

// LUT900L Configuration

#define	GFXMMU_LUT900L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT900L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT900L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT900L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT900L_EN		(0x1u<<0)

// LUT900H Configuration

#define	GFXMMU_LUT900H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT900H_LO_0		(0x1u<<4)

// LUT901L Configuration

#define	GFXMMU_LUT901L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT901L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT901L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT901L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT901L_EN		(0x1u<<0)

// LUT901H Configuration

#define	GFXMMU_LUT901H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT901H_LO_0		(0x1u<<4)

// LUT902L Configuration

#define	GFXMMU_LUT902L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT902L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT902L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT902L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT902L_EN		(0x1u<<0)

// LUT902H Configuration

#define	GFXMMU_LUT902H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT902H_LO_0		(0x1u<<4)

// LUT903L Configuration

#define	GFXMMU_LUT903L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT903L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT903L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT903L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT903L_EN		(0x1u<<0)

// LUT903H Configuration

#define	GFXMMU_LUT903H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT903H_LO_0		(0x1u<<4)

// LUT904L Configuration

#define	GFXMMU_LUT904L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT904L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT904L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT904L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT904L_EN		(0x1u<<0)

// LUT904H Configuration

#define	GFXMMU_LUT904H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT904H_LO_0		(0x1u<<4)

// LUT905L Configuration

#define	GFXMMU_LUT905L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT905L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT905L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT905L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT905L_EN		(0x1u<<0)

// LUT905H Configuration

#define	GFXMMU_LUT905H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT905H_LO_0		(0x1u<<4)

// LUT906L Configuration

#define	GFXMMU_LUT906L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT906L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT906L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT906L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT906L_EN		(0x1u<<0)

// LUT906H Configuration

#define	GFXMMU_LUT906H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT906H_LO_0		(0x1u<<4)

// LUT907L Configuration

