Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
#define	GFXMMU_LUT926L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT926L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT926L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT926L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT926L_EN		(0x1u<<0)

// LUT926H Configuration

#define	GFXMMU_LUT926H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT926H_LO_0		(0x1u<<4)

// LUT927L Configuration

#define	GFXMMU_LUT927L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT927L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT927L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT927L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT927L_EN		(0x1u<<0)

// LUT927H Configuration

#define	GFXMMU_LUT927H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT927H_LO_0		(0x1u<<4)

// LUT928L Configuration

#define	GFXMMU_LUT928L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT928L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT928L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT928L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT928L_EN		(0x1u<<0)

// LUT928H Configuration

#define	GFXMMU_LUT928H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT928H_LO_0		(0x1u<<4)

// LUT929L Configuration

#define	GFXMMU_LUT929L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT929L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT929L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT929L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT929L_EN		(0x1u<<0)

// LUT929H Configuration

#define	GFXMMU_LUT929H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT929H_LO_0		(0x1u<<4)

// LUT930L Configuration

#define	GFXMMU_LUT930L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT930L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT930L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT930L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT930L_EN		(0x1u<<0)

// LUT930H Configuration

#define	GFXMMU_LUT930H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT930H_LO_0		(0x1u<<4)

// LUT931L Configuration

#define	GFXMMU_LUT931L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT931L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT931L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT931L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT931L_EN		(0x1u<<0)

// LUT931H Configuration

#define	GFXMMU_LUT931H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT931H_LO_0		(0x1u<<4)

// LUT932L Configuration

#define	GFXMMU_LUT932L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT932L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT932L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT932L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT932L_EN		(0x1u<<0)

// LUT932H Configuration

#define	GFXMMU_LUT932H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT932H_LO_0		(0x1u<<4)

// LUT933L Configuration

#define	GFXMMU_LUT933L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT933L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT933L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT933L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT933L_EN		(0x1u<<0)

// LUT933H Configuration

#define	GFXMMU_LUT933H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT933H_LO_0		(0x1u<<4)

// LUT934L Configuration

#define	GFXMMU_LUT934L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT934L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT934L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT934L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT934L_EN		(0x1u<<0)

// LUT934H Configuration

#define	GFXMMU_LUT934H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT934H_LO_0		(0x1u<<4)

// LUT935L Configuration

#define	GFXMMU_LUT935L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT935L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT935L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT935L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT935L_EN		(0x1u<<0)

// LUT935H Configuration

#define	GFXMMU_LUT935H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT935H_LO_0		(0x1u<<4)

// LUT936L Configuration

#define	GFXMMU_LUT936L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT936L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT936L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT936L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT936L_EN		(0x1u<<0)

// LUT936H Configuration

#define	GFXMMU_LUT936H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT936H_LO_0		(0x1u<<4)

// LUT937L Configuration

#define	GFXMMU_LUT937L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT937L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT937L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT937L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT937L_EN		(0x1u<<0)

// LUT937H Configuration

#define	GFXMMU_LUT937H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT937H_LO_0		(0x1u<<4)

// LUT938L Configuration

#define	GFXMMU_LUT938L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT938L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT938L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT938L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT938L_EN		(0x1u<<0)

// LUT938H Configuration

#define	GFXMMU_LUT938H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT938H_LO_0		(0x1u<<4)

// LUT939L Configuration

#define	GFXMMU_LUT939L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT939L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT939L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT939L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT939L_EN		(0x1u<<0)

// LUT939H Configuration

#define	GFXMMU_LUT939H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT939H_LO_0		(0x1u<<4)

// LUT940L Configuration

#define	GFXMMU_LUT940L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT940L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT940L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT940L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT940L_EN		(0x1u<<0)

// LUT940H Configuration

#define	GFXMMU_LUT940H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT940H_LO_0		(0x1u<<4)

// LUT941L Configuration

#define	GFXMMU_LUT941L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT941L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT941L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT941L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT941L_EN		(0x1u<<0)

// LUT941H Configuration

#define	GFXMMU_LUT941H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT941H_LO_0		(0x1u<<4)

// LUT942L Configuration

#define	GFXMMU_LUT942L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT942L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT942L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT942L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT942L_EN		(0x1u<<0)

// LUT942H Configuration

#define	GFXMMU_LUT942H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT942H_LO_0		(0x1u<<4)

// LUT943L Configuration

#define	GFXMMU_LUT943L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT943L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT943L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT943L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT943L_EN		(0x1u<<0)

// LUT943H Configuration

#define	GFXMMU_LUT943H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT943H_LO_0		(0x1u<<4)

// LUT944L Configuration

#define	GFXMMU_LUT944L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT944L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT944L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT944L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT944L_EN		(0x1u<<0)

// LUT944H Configuration

#define	GFXMMU_LUT944H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT944H_LO_0		(0x1u<<4)

// LUT945L Configuration

