Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
// LUT983L Configuration

#define	GFXMMU_LUT983L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT983L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT983L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT983L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT983L_EN		(0x1u<<0)

// LUT983H Configuration

#define	GFXMMU_LUT983H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT983H_LO_0		(0x1u<<4)

// LUT984L Configuration

#define	GFXMMU_LUT984L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT984L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT984L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT984L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT984L_EN		(0x1u<<0)

// LUT984H Configuration

#define	GFXMMU_LUT984H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT984H_LO_0		(0x1u<<4)

// LUT985L Configuration

#define	GFXMMU_LUT985L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT985L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT985L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT985L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT985L_EN		(0x1u<<0)

// LUT985H Configuration

#define	GFXMMU_LUT985H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT985H_LO_0		(0x1u<<4)

// LUT986L Configuration

#define	GFXMMU_LUT986L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT986L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT986L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT986L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT986L_EN		(0x1u<<0)

// LUT986H Configuration

#define	GFXMMU_LUT986H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT986H_LO_0		(0x1u<<4)

// LUT987L Configuration

#define	GFXMMU_LUT987L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT987L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT987L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT987L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT987L_EN		(0x1u<<0)

// LUT987H Configuration

#define	GFXMMU_LUT987H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT987H_LO_0		(0x1u<<4)

// LUT988L Configuration

#define	GFXMMU_LUT988L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT988L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT988L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT988L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT988L_EN		(0x1u<<0)

// LUT988H Configuration

#define	GFXMMU_LUT988H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT988H_LO_0		(0x1u<<4)

// LUT989L Configuration

#define	GFXMMU_LUT989L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT989L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT989L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT989L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT989L_EN		(0x1u<<0)

// LUT989H Configuration

#define	GFXMMU_LUT989H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT989H_LO_0		(0x1u<<4)

// LUT990L Configuration

#define	GFXMMU_LUT990L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT990L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT990L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT990L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT990L_EN		(0x1u<<0)

// LUT990H Configuration

#define	GFXMMU_LUT990H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT990H_LO_0		(0x1u<<4)

// LUT991L Configuration

#define	GFXMMU_LUT991L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT991L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT991L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT991L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT991L_EN		(0x1u<<0)

// LUT991H Configuration

#define	GFXMMU_LUT991H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT991H_LO_0		(0x1u<<4)

// LUT992L Configuration

#define	GFXMMU_LUT992L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT992L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT992L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT992L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT992L_EN		(0x1u<<0)

// LUT992H Configuration

#define	GFXMMU_LUT992H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT992H_LO_0		(0x1u<<4)

// LUT993L Configuration

#define	GFXMMU_LUT993L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT993L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT993L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT993L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT993L_EN		(0x1u<<0)

// LUT993H Configuration

#define	GFXMMU_LUT993H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT993H_LO_0		(0x1u<<4)

// LUT994L Configuration

#define	GFXMMU_LUT994L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT994L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT994L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT994L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT994L_EN		(0x1u<<0)

// LUT994H Configuration

#define	GFXMMU_LUT994H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT994H_LO_0		(0x1u<<4)

// LUT995L Configuration

#define	GFXMMU_LUT995L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT995L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT995L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT995L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT995L_EN		(0x1u<<0)

// LUT995H Configuration

#define	GFXMMU_LUT995H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT995H_LO_0		(0x1u<<4)

// LUT996L Configuration

#define	GFXMMU_LUT996L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT996L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT996L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT996L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT996L_EN		(0x1u<<0)

// LUT996H Configuration

#define	GFXMMU_LUT996H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT996H_LO_0		(0x1u<<4)

// LUT997L Configuration

#define	GFXMMU_LUT997L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT997L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT997L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT997L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT997L_EN		(0x1u<<0)

// LUT997H Configuration

#define	GFXMMU_LUT997H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT997H_LO_0		(0x1u<<4)

// LUT998L Configuration

#define	GFXMMU_LUT998L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT998L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT998L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT998L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT998L_EN		(0x1u<<0)

// LUT998H Configuration

#define	GFXMMU_LUT998H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT998H_LO_0		(0x1u<<4)

// LUT999L Configuration

#define	GFXMMU_LUT999L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT999L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT999L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT999L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT999L_EN		(0x1u<<0)

// LUT999H Configuration

#define	GFXMMU_LUT999H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT999H_LO_0		(0x1u<<4)

// LUT1000L Configuration

#define	GFXMMU_LUT1000L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT1000L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT1000L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT1000L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT1000L_EN		(0x1u<<0)

// LUT1000H Configuration

#define	GFXMMU_LUT1000H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT1000H_LO_0	(0x1u<<4)

// LUT1001L Configuration

#define	GFXMMU_LUT1001L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT1001L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT1001L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT1001L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT1001L_EN		(0x1u<<0)

// LUT1001H Configuration

