Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_gfxmmu.h
#define	GFXMMU_LUT1001H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT1001H_LO_0	(0x1u<<4)

// LUT1002L Configuration

#define	GFXMMU_LUT1002L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT1002L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT1002L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT1002L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT1002L_EN		(0x1u<<0)

// LUT1002H Configuration

#define	GFXMMU_LUT1002H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT1002H_LO_0	(0x1u<<4)

// LUT1003L Configuration

#define	GFXMMU_LUT1003L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT1003L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT1003L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT1003L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT1003L_EN		(0x1u<<0)

// LUT1003H Configuration

#define	GFXMMU_LUT1003H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT1003H_LO_0	(0x1u<<4)

// LUT1004L Configuration

#define	GFXMMU_LUT1004L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT1004L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT1004L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT1004L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT1004L_EN		(0x1u<<0)

// LUT1004H Configuration

#define	GFXMMU_LUT1004H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT1004H_LO_0	(0x1u<<4)

// LUT1005L Configuration

#define	GFXMMU_LUT1005L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT1005L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT1005L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT1005L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT1005L_EN		(0x1u<<0)

// LUT1005H Configuration

#define	GFXMMU_LUT1005H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT1005H_LO_0	(0x1u<<4)

// LUT1006L Configuration

#define	GFXMMU_LUT1006L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT1006L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT1006L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT1006L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT1006L_EN		(0x1u<<0)

// LUT1006H Configuration

#define	GFXMMU_LUT1006H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT1006H_LO_0	(0x1u<<4)

// LUT1007L Configuration

#define	GFXMMU_LUT1007L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT1007L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT1007L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT1007L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT1007L_EN		(0x1u<<0)

// LUT1007H Configuration

#define	GFXMMU_LUT1007H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT1007H_LO_0	(0x1u<<4)

// LUT1008L Configuration

#define	GFXMMU_LUT1008L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT1008L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT1008L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT1008L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT1008L_EN		(0x1u<<0)

// LUT1008H Configuration

#define	GFXMMU_LUT1008H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT1008H_LO_0	(0x1u<<4)

// LUT1009L Configuration

#define	GFXMMU_LUT1009L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT1009L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT1009L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT1009L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT1009L_EN		(0x1u<<0)

// LUT1009H Configuration

#define	GFXMMU_LUT1009H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT1009H_LO_0	(0x1u<<4)

// LUT1010L Configuration

#define	GFXMMU_LUT1010L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT1010L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT1010L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT1010L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT1010L_EN		(0x1u<<0)

// LUT1010H Configuration

#define	GFXMMU_LUT1010H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT1010H_LO_0	(0x1u<<4)

// LUT1011L Configuration

#define	GFXMMU_LUT1011L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT1011L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT1011L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT1011L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT1011L_EN		(0x1u<<0)

// LUT1011H Configuration

#define	GFXMMU_LUT1011H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT1011H_LO_0	(0x1u<<4)

// LUT1012L Configuration

#define	GFXMMU_LUT1012L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT1012L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT1012L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT1012L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT1012L_EN		(0x1u<<0)

// LUT1012H Configuration

#define	GFXMMU_LUT1012H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT1012H_LO_0	(0x1u<<4)

// LUT1013L Configuration

#define	GFXMMU_LUT1013L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT1013L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT1013L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT1013L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT1013L_EN		(0x1u<<0)

// LUT1013H Configuration

#define	GFXMMU_LUT1013H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT1013H_LO_0	(0x1u<<4)

// LUT1014L Configuration

#define	GFXMMU_LUT1014L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT1014L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT1014L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT1014L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT1014L_EN		(0x1u<<0)

// LUT1014H Configuration

#define	GFXMMU_LUT1014H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT1014H_LO_0	(0x1u<<4)

// LUT1015L Configuration

#define	GFXMMU_LUT1015L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT1015L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT1015L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT1015L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT1015L_EN		(0x1u<<0)

// LUT1015H Configuration

#define	GFXMMU_LUT1015H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT1015H_LO_0	(0x1u<<4)

// LUT1016L Configuration

#define	GFXMMU_LUT1016L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT1016L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT1016L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT1016L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT1016L_EN		(0x1u<<0)

// LUT1016H Configuration

#define	GFXMMU_LUT1016H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT1016H_LO_0	(0x1u<<4)

// LUT1017L Configuration

#define	GFXMMU_LUT1017L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT1017L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT1017L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT1017L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT1017L_EN		(0x1u<<0)

// LUT1017H Configuration

#define	GFXMMU_LUT1017H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT1017H_LO_0	(0x1u<<4)

// LUT1018L Configuration

#define	GFXMMU_LUT1018L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT1018L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT1018L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT1018L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT1018L_EN		(0x1u<<0)

// LUT1018H Configuration

#define	GFXMMU_LUT1018H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT1018H_LO_0	(0x1u<<4)

// LUT1019L Configuration

#define	GFXMMU_LUT1019L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT1019L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT1019L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT1019L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT1019L_EN		(0x1u<<0)

// LUT1019H Configuration

#define	GFXMMU_LUT1019H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT1019H_LO_0	(0x1u<<4)

// LUT1020L Configuration

#define	GFXMMU_LUT1020L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT1020L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT1020L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT1020L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT1020L_EN		(0x1u<<0)

// LUT1020H Configuration

#define	GFXMMU_LUT1020H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT1020H_LO_0	(0x1u<<4)

// LUT1021L Configuration

#define	GFXMMU_LUT1021L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT1021L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT1021L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT1021L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT1021L_EN		(0x1u<<0)

// LUT1021H Configuration

#define	GFXMMU_LUT1021H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT1021H_LO_0	(0x1u<<4)

// LUT1022L Configuration

#define	GFXMMU_LUT1022L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT1022L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT1022L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT1022L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT1022L_EN		(0x1u<<0)

// LUT1022H Configuration

#define	GFXMMU_LUT1022H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT1022H_LO_0	(0x1u<<4)

// LUT1023L Configuration

#define	GFXMMU_LUT1023L_LVB		(0xFFu<<16)
#define	GFXMMU_LUT1023L_LVB_0	(0x1u<<16)
#define	GFXMMU_LUT1023L_FVB		(0xFFu<<8)
#define	GFXMMU_LUT1023L_FVB_0	(0x1u<<8)
#define	GFXMMU_LUT1023L_EN		(0x1u<<0)

// LUT1023H Configuration

#define	GFXMMU_LUT1023H_LO		(0x3FFFFu<<4)
#define	GFXMMU_LUT1023H_LO_0	(0x1u<<4)
